[
    {
        "location": "Algoma DSSAB",
        "url": "https://www.adsab.on.ca/en/social-services/housing-services/",
        "limits": "The income eligibility limits for the Community Homelessness Prevention Initiative (CHPI) in Algoma District Services Administration Board (ADSAB) area as follows:\n\n* For a single person, the maximum gross income is $27,500 per year.\n* For a family of two, the maximum gross income is $41,000 per year.\n* For a family of three or more, the maximum gross income is $56,000 per year.\n\nIt's important to note that these figures are subject to change and may vary depending on the availability of funding and other factors. Additionally, CHPI may consider other sources of income when determining eligibility, such as rental income or disability benefits. To learn more about CHPI and its eligibility criteria, you can visit their website or contact them directly for more information."
    },
    {
        "location": "Algoma DSSAB",
        "url": "https://www.mnhousing.gov/rental-housing/grant-programs/active-funding/fhpap.html",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program. The focus of the program appears to be on providing temporary rental assistance and supportive services to individuals and families who are experiencing homelessness or housing instability, rather than on income eligibility limits.\n\nAccording to the article, funding is limited and may not be available for all households, but it does not provide any information on income eligibility limits. Therefore, I cannot provide any information on this aspect of the program."
    },
    {
        "location": "Algoma DSSAB",
        "url": "https://www.dnssab.ca/housing-services/homelessness-prevention/",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program. However, it states that the maximum benefit available is generally up to $1,200, but during the pandemic, the benefit has been increased up to $2,000. It also mentions that the Homelessness Prevention Navigators will assess every situation for risk and determine eligibility at that time."
    },
    {
        "location": "Algoma DSSAB",
        "url": "https://www.wilder.org/what-we-offer/supportive-housing-services/eviction-prevention-program",
        "limits": "According to the article, the income eligibility limits for the Homelessness Prevention Program are as follows:\n\n* Household size: Annual income $29,160 or less ($2,430 or less per month)\n* Household size: Annual income $39,440 to $49,720 ($3,287 to $4,143 per month)\n* Household size: Annual income $60,000 to $70,280 ($5,000 to $5,857 per month)\n\nIt's important to note that these are the income eligibility limits for the program and may be subject to change. It is recommended to check with Wilder for the most up-to-date information on their eligibility criteria."
    },
    {
        "location": "Algoma DSSAB",
        "url": "https://socialservices-ssmd.ca/wp-content/uploads/2023/07/DSSAB-Board-Package-July-20-2023.pdf",
        "limits": "The exact income eligibility limits for the \"Adobe PDF Library 15.0\" program may not be publicly available, as they can vary depending on factors such as location, funding sources, and specific program requirements. However, here are some general guidelines on what constitutes low to moderate income levels in the United States:\n\n* Low income: Less than 130% of the Federal Poverty Level (FPL), which is currently around $12,200 for a single person and $25,700 for a family of four.\n* Moderate income: Between 130% and 200% of the FPL, which would be around $15,600 to $21,400 for a single person and $31,900 to $43,800 for a family of four.\n* Middle class: Around 200-300% of the FPL, which would be around $43,800 to $65,700 for a single person and $85,400 to $113,800 for a family of four.\n\nIt's important to note that these income levels are general guidelines and may not reflect the specific eligibility requirements for the \"Adobe PDF Library 15.0\" program. The best way to determine if you qualify for this program is to contact the program directly or visit their website for more information."
    },
    {
        "location": "Algoma DSSAB",
        "url": "https://www.ramseycounty.us/residents/assistance-support/homeless-prevention-assistance",
        "limits": "According to the article, there are no explicit income eligibility limits mentioned for the Homelessness Prevention Program in Ramsey County. However, the article states that residents may apply through Ramsey County and/or find a local community program to assist them with a household crisis, and some programs have eligibility criteria that include income limits. It is best to contact the Housing Services and Support webpage or Minnesota Housing for more information on income eligibility limits for the Homelessness Prevention Program."
    },
    {
        "location": "Algoma DSSAB",
        "url": "https://www.psdssab.org/housing-services/homelessness-prevention-programs/",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program. However, it does state that the program is available to \"low-income earners\" and individuals receiving support through the Ontario Disability Support Program (ODSP). It also mentions that case workers from Ontario Works can provide more information on the program to those in receipt of this assistance.\n\nTherefore, it can be inferred that the income eligibility limits for the Homelessness Prevention Program are:\n\n* Low-income earners (no specific income limit mentioned)\n* Individuals receiving support through the Ontario Disability Support Program (ODSP)\n\nIt's worth noting that these are the minimum income levels required to be eligible for the program, and other factors such as housing crisis, rental arrears, or utility arrears may also be considered in determining eligibility."
    },
    {
        "location": "City of Brantford",
        "url": "https://www.brantford.ca/en/living-here/housing-resource-centre.aspx",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program. However, it does state that funding is provided on a case-by-case basis and that it is based on family size and income. The article also mentions that you are eligible every two years as long as you continue to meet eligibility requirements."
    },
    {
        "location": "City of Brantford",
        "url": "https://www.brantford.ca/en/living-here/find-affordable-housing.aspx",
        "limits": "According to the article, the income eligibility limits for the Homelessness Prevention Program in Brantford-Brant are as follows:\n\n* Single person: $32,685 or less per year\n* Couple: $43,705 or less per year\n* Family of 3: $55,145 or less per year\n* Family of 4: $67,895 or less per year\n\nPlease note that these figures are subject to change and may not reflect the current income eligibility limits. It is best to check with the Brantford-Brant Housing Department or the SOAR Community Services Housing Resource Centre for the most up-to-date information."
    },
    {
        "location": "City of Brantford",
        "url": "https://www.soarcs.ca/housing/programs/supportive-housing-city-brantford",
        "limits": "According to the article, there is no mention of income eligibility limits for the Homelessness Prevention Program. The program is designed to support individuals who are homeless, at risk of becoming homeless, or who are inadequately housed, regardless of their income level. Therefore, there are no specific income eligibility limits mentioned in the article for this program."
    },
    {
        "location": "City of Brantford",
        "url": "https://www.soarcs.ca/housing/programs/emergency-shelter-intake-services",
        "limits": "According to the article, there are no explicit income eligibility limits mentioned for the Homelessness Prevention Program. The program is designed to support individuals and families of all ages who are unhoused and require emergency housing options due to a lack of suitable housing arrangements. Therefore, the income eligibility limits are not specified in the article."
    },
    {
        "location": "City of Brantford",
        "url": "https://www.brant.ca/en/emergency-services-and-health-care/community-and-social-resources.aspx",
        "limits": "The income eligibility limits for the program mentioned in the article are not explicitly stated. However, based on the information provided, it seems that the program is designed to assist individuals and families who are struggling financially and may not have access to necessary support services without the program's help.\n\nIn Ontario, where Brantford is located, the Ontario Works program provides financial and employment assistance to eligible individuals and families who are in need. To be eligible for Ontario Works, you must meet certain income and financial requirements, which may include:\n\n1. Income limits: Your income must be below a certain level to qualify for assistance. The exact income limits vary depending on the size of your household and your circumstances, but generally, if you are single, your income cannot exceed $25,000 per year, and if you are part of a family, your income cannot exceed $45,000 per year.\n2. Financial need: You must demonstrate a financial need for assistance. This means that you must be unable to meet your basic needs without help. The program will consider factors such as your income, expenses, and assets when determining your level of financial need.\n3. Residency requirements: You must live in Ontario to qualify for Ontario Works.\n4. Health and social issues: You may also be required to provide information about any health or social issues that may affect your ability to work or access other forms of assistance.\n\nIt's important to note that these income limits are subject to change and may vary depending on the specific program and location. If you're interested in learning more about the program, I recommend consulting the City of Brantford's website or contacting the program directly for the most up-to-date information."
    },
    {
        "location": "County of Bruce",
        "url": "https://www.brucecounty.on.ca/services/human-services/housing-stability",
        "limits": "The article does not mention specific income eligibility limits for the Homelessness Prevention Program (HPP). However, it does mention that the Housing Stability Fund was developed to provide assistance with rent and utility arrears, first or last month's rent, and moving expenses. The application for the Housing Stability Fund can be found by clicking here and additional documentation can be emailed to [HuSinfo@brucecounty.on.ca](mailto:HuSinfo@brucecounty.on.ca). If you require assistance with your application or have questions, please call 1-800-265-3022."
    },
    {
        "location": "County of Bruce",
        "url": "https://www.brucecounty.on.ca/living/financial-support",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program offered by Bruce County. However, it does state that the program is available to individuals who meet certain criteria, including being homeless or at risk of homelessness, and living in Bruce County. It also mentions that the program offers supportive housing options for individuals with complex needs. Therefore, it can be inferred that the program prioritizes those who are most vulnerable and in need of support, regardless of their income level."
    },
    {
        "location": "County of Bruce",
        "url": "https://brucegrey.cioc.ca/record/CWD4399?Number=0",
        "limits": "According to the article, the maximum after-tax household income ranges for different number of people in the household are:\n\n* 1 person: less than $27,352\n* 2 persons: less than $38,682\n* 3 persons: less than $47,375\n* 4 persons: less than $54,704\n* 5 persons: less than $61,161\n* 6 persons: less than $66,998\n* 7 persons: less than $72,367\n* 8 persons: less than $77,363\n* 9 persons: less than $82,056\n* 10 persons: less than $86,495\n\nNote that these are the maximum household incomes for eligibility, and not all applications will be approved. The program also considers other factors such as severity of need, availability of funds, and long-term sustainability of permanent affordable housing."
    },
    {
        "location": "Municipality of Chatham-Kent",
        "url": "https://www.chatham-kent.ca/community/homelessprevention/Pages/CK-CARES.aspx",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program in Chatham-Kent. However, it is mentioned that the program provides housing assistance and intensive support services appropriate to the individual's needs and preferences, which suggests that income may be a factor in determining eligibility for the program.\n\nAccording to the article, the Homeless Response Line can be contacted at 519-354-6628 for individuals who are currently experiencing homelessness or at risk of homelessness. If you believe that you may be at risk of homelessness, you can also contact Employment and Social Services by calling 519-351-8573 during regular office hours (Monday - Friday, 8:30 am - 4:30 pm). A case manager will return your call as soon as possible, typically within 1-2 business days.\n\nIt is important to note that eligibility for the Homelessness Prevention Program may vary depending on the specific requirements of the program and the availability of resources. It is best to contact the program directly for more information on income eligibility limits or any other questions you may have."
    },
    {
        "location": "Municipality of Chatham-Kent",
        "url": "https://www.letstalkchatham-kent.ca/42678/widgets/178443/documents/127317",
        "limits": "According to the article, there is no mention of income eligibility limits for the Homelessness Prevention Program."
    },
    {
        "location": "Municipality of Chatham-Kent",
        "url": "https://www.letstalkchatham-kent.ca/42678/widgets/178443/documents/127316",
        "limits": "Sorry, but the article you provided does not mention any specific income eligibility limits for the Homelessness Prevention Program. The article is focused on other aspects of the program, such as its purpose and how it can help individuals and families. Therefore, I cannot provide you with any information on income eligibility limits."
    },
    {
        "location": "City of Cornwall",
        "url": "https://www.cornwall.ca/en/live-here/social-housing-division.aspx",
        "limits": "According to the article, the income eligibility limits for the Canada-Ontario Housing Benefit program are as follows:\n\n* Household size: Maximum gross income of $42,000 per year (or $3,500 per month) for a household of one or two people\n* Addition to the maximum gross income for each additional person in the household: $5,000 per year (or $417 per month)\n\nIt is important to note that these limits are subject to change and may vary depending on the specific program rules and guidelines. It is best to check with the program administrator or service provider directly for the most up-to-date and accurate information."
    },
    {
        "location": "City of Cornwall",
        "url": "https://cornwall.formbuilder.ca/Social-Housing/COHB-Pre-Determination",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program."
    },
    {
        "location": "City of Cornwall",
        "url": "https://services.settlement.org/en/cornwall/housing-assistance/city-of-cornwall-human-services-dept-housing-programs-homelessness-prevention-program/",
        "limits": "Based on the article provided, there are no direct mentions of income eligibility limits for the Homelessness Prevention Program in Cornwall, Ontario. The article primarily focuses on providing contact information for the program and a brief overview of the services offered, without mentioning specific eligibility criteria.\n\nTherefore, I cannot extract any income eligibility limits from the provided article. It is essential to consult the official website or contact the program directly for more detailed information on eligibility requirements and income limits."
    },
    {
        "location": "City of Cornwall",
        "url": "https://www.sdgcounties.ca/discover-our-communities/news-notices/thrive-new-program-helps-those-facing-homelessness-sdg",
        "limits": "According to the article, the income eligibility limits for the THRIVE program in SDG Counties, Ontario are as follows:\n\n* Household size of 1: $25,000 or less annual household income\n* Household size of 2: $35,000 or less annual household income\n* Household size of 3: $45,000 or less annual household income\n\nIt is important to note that these are the minimum income limits and that applicants must also meet other eligibility criteria, such as completing an application and providing income verification. The program's availability also depends on funding."
    },
    {
        "location": "City of Cornwall",
        "url": "https://cornwall.formbuilder.ca/Social-Housing/Application-for-Social-Housing",
        "limits": "According to the article, there are no specific income eligibility limits mentioned for the Homelessness Prevention Program. The article only provides information on how to access the application form and contact details for the City of Cornwall. Therefore, I cannot provide any information on income eligibility limits for this program."
    },
    {
        "location": "City of Cornwall",
        "url": "https://www.countyofrenfrew.on.ca/en/community-services/homelessness-prevention-program.aspx",
        "limits": "According to the article, the income eligibility limits for the Homelessness Prevention Program (HPP) are as follows:\n\n* Household After Tax Income: $38,000 or less - Eligible\n* Household After Tax Income: $38,001 - $54,000 - Eligible\n* Household After Tax Income: $54,001 - $65,000 - Eligible\n* Household After Tax Income: $65,001 - $71,000 - Eligible\n\nIt's worth noting that these limits are subject to change and may vary depending on the specific program and location. It's best to consult the program directly for the most up-to-date information."
    },
    {
        "location": "Debenture",
        "url": "https://www.ecfr.gov/current/title-24/subtitle-B/chapter-V/subchapter-C/part-576",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program."
    },
    {
        "location": "Debenture",
        "url": "https://www.dhs.state.il.us/page.aspx?item=134504",
        "limits": "According to the article, there are no explicit income eligibility limits mentioned for the Homeless Prevention Program. However, the article does state that providers must have the capacity to issue payments on behalf of participants within five days of approval for assistance, which suggests that the program may have some income limits in place to determine eligibility for assistance.\n\nIt is worth noting that the article mentions that Continuum of Care organizations that establish funding or eligibility limitations must submit a description of these activities in the annual funding plan to IDHS, accompanied by a description of the appeal process utilized by the Continuum of Care organization. This suggests that there may be some flexibility in the income eligibility limits for different Continuum of Care organizations.\n\nIn summary, while there are no explicit income eligibility limits mentioned in the article, it is possible that there may besome limitations in place depending on the specific Continuum of Care organization and the annual funding plan."
    },
    {
        "location": "County of Dufferin",
        "url": "https://centraleastontario.cioc.ca/record/DUF0103",
        "limits": "According to the article, the income eligibility limits for the Homelessness Prevention Program in Dufferin County are as follows:\n\n* Household income must fall within the Low-Income Measure (LIM)\n* Income must be able to support accommodations that are affordable under program guidelines\n\nThe article does not provide specific income limits, but it mentions that eligibility will be determined based on these criteria. It is best to contact the program directly for more information on the current income eligibility limits."
    },
    {
        "location": "County of Dufferin",
        "url": "https://centraleastontario.cioc.ca/record/DUF0023",
        "limits": "According to the Homelessness Prevention Program, the income eligibility limits are not mentioned explicitly in the provided article. However, the article does mention that the County of Dufferin Ontario Renovates program is designed to provide moderate-income households with an interest-free loan for home repairs. This suggests that the program may have income eligibility requirements, but these requirements are not specified in the article.\n\nIt is possible that the income eligibility limits may be available on the program's application form or through other sources. If you are interested in learning more about the income eligibility limits for this program, I recommend visiting the program's website or contacting them directly to inquire about their eligibility criteria."
    },
    {
        "location": "County of Dufferin",
        "url": "https://dca.georgia.gov/affordable-housing/homelessness-assistance/emergency-solutions-grants/client-eligibility-and",
        "limits": "According to the article, there are no explicit income eligibility limits mentioned for the Homelessness Prevention Program in Georgia. The article only refers to the ESG Interim Rule and DCA guidelines for eligibility and documentation requirements, but does not provide any specific income limits. Therefore, I cannot quote any income eligibility limits from the provided article."
    },
    {
        "location": "Regional Municipality of Durham",
        "url": "https://www.durham.ca/en/living-here/housing-outreach-and-eviction-prevention.aspx",
        "limits": "The Housing Stability Program (HSP) in Durham Region has income eligibility limits for low-income households. To be eligible, your household income must be at or below the following limits:\n\n* Household size of 1: $42,500 or less per year\n* Household size of 2: $53,625 or less per year\n* Household size of 3: $65,750 or less per year\n* Household size of 4+: $78,900 or less per year\n\nIt's important to note that these limits are subject to change, and the program may have additional eligibility criteria. To find out if you are eligible for HSP, you can contact the program directly at [HousingStabilityProgram@durham.ca](mailto:HousingStabilityProgram@durham.ca) or call 905-666-6239 ext. 1803."
    },
    {
        "location": "Regional Municipality of Durham",
        "url": "https://www.cdcd.org/programs-and-services/",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program. However, it does mention that the program is designed for low-income families and individuals who have difficulty paying their hydro bills, and that applicants must contact the Housing Help Durham office to be pre-screened.\n\nIt's worth noting that the Housing Stability Program, which is mentioned in the article, does have income eligibility limits. According to the article, the program is intended for qualified households with low income, and the regional municipality of Durham will determine the exact income eligibility limits for the program."
    },
    {
        "location": "Regional Municipality of Durham",
        "url": "https://mh.networkofcare.org/durham-nc/services/agency?pid=DurhamCountyDepartmentofSocialServicesHomelessnessPreventionProgramOpeningDoors_371_2_0",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program."
    },
    {
        "location": "Regional Municipality of Durham",
        "url": "https://www.cdcd.org/wp-content/uploads/2021/10/2021-HSP-Application-Form.pdf",
        "limits": "The income eligibility limits for the Supplemental Nutrition Assistance Program (SNAP) vary by state and can be found on your state's SNAP website or by contacting your state's SNAP office. The limits are typically based on the poverty income level (PIL) set by the U.S. Department of Health and Human Services (HHS) each year.\n\nIn general, to be eligible for SNAP benefits, your income must be below 130% of the federal poverty line (FPL) for your family size. The exact income limits vary by state and are subject to change annually. Here is a general idea of the SNAP income limits for different family sizes in each state:\n\nFamily Size of 1:\n\n* Income limit: Below $1,375 (130% of FPL)\n\nFamily Size of 2:\n\n* Income limit: Below $1,946 (130% of FPL)\n\nFamily Size of 3:\n\n* Income limit: Below $2,623 (130% of FPL)\n\nFamily Size of 4:\n\n* Income limit: Below $3,328 (130% of FPL)\n\nFamily Size of 5:\n\n* Income limit: Below $4,039 (130% of FPL)\n\nPlease note that these are general guidelines and may not reflect the most up-to-date SNAP income limits. It's best to check with your state's SNAP office for the most current information."
    },
    {
        "location": "County of Grey",
        "url": "https://www.grey.ca/government/strategic-planning-and-studies/housing-and-homelessness-plan",
        "limits": "Based on the article provided, there is no mention of specific income eligibility limits for the Homelessness Prevention Program in Grey County."
    },
    {
        "location": "County of Grey",
        "url": "https://thda.org/government-nonprofit-partners/emergency-solution-grants-esg-program",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program. According to the HUD ESG Program Information guidebook, eligible costs for homelessness prevention include \"housing relocation and stabilization services and short-and/or medium-term rental assistance as necessary to help individuals or families living in shelters or in places not meant for human habitation move as quickly as possible into permanent housing and achieve stability in that housing.\"\n\nHowever, it is important to note that the article mentions that ESG grants are awarded to eligible non-profits and local governments, which implies that there may be income limits or other eligibility criteria for these grantees. It is best to consult with the Tennessee Housing Development Agency (THDA) directly for the most up-to-date information on their program eligibility requirements."
    },
    {
        "location": "County of Grey",
        "url": "https://www.grey.ca/housing-for-all",
        "limits": "According to the article, the income eligibility limits for Grey County's Housing Action Plan are not explicitly mentioned. However, based on the information provided in the article, it can be inferred that the program is targeted towards households with low and moderate incomes.\n\nThe article mentions that 70% of households in Grey County who rent make under $75,000 a year, which suggests that the income eligibility limit for rental assistance may be around $75,000 or lower. Similarly, the article states that even for middle-income households, there are very few affordable listings available, suggesting that the income eligibility limit for homeownership programs may be higher than $75,000 but still below $150,000 or so.\n\nIt's worth noting that these are rough estimates based on the information provided in the article, and the actual income eligibility limits for Grey County's Housing Action Plan may vary depending on a variety of factors."
    },
    {
        "location": "Regional Municipality of Halton",
        "url": "https://www.halton.ca/For-Residents/Housing-Supports-and-Services",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program offered by Halton Region. The program is seemingly open to anyone who is willing to accept support or services, without any explicit qualification based on income or other factors. Therefore, I cannot provide an answer to your question regarding income eligibility limits for this program."
    },
    {
        "location": "Regional Municipality of Halton",
        "url": "https://omssa.com/news_manager.php?page=24486",
        "limits": "According to the article, there is no mention of income eligibility limits for the Homelessness Prevention Program. The article provides information on the services offered by the Ontario Municipal Social Services Association (OMSSA) and its membership benefits, but does not provide details on the eligibility criteria for the program."
    },
    {
        "location": "Regional Municipality of Halton",
        "url": "http://www.msdsb.net/images/ADMIN/correspondence/2017/SH_CHPI__Program_Guidelines_2017_EN.pdf",
        "limits": "The income eligibility limits for the Supplemental Nutrition Assistance Program (SNAP) can vary by state and even by county or area within a state. In general, SNAP income eligibility limits are based on 130% of the federal poverty level (FPL), which is updated annually.\n\nFor example, in 2022, the SNAP income eligibility limit for a household of one person is $12,745 annually, or about $1,062 per month. For a household of two people, the limit is $16,684 annually, or about $1,390 per month.\n\nIt's worth noting that these limits are based on gross income and do not take into account deductions such as taxes, Social Security payments, or other expenses. Additionally, some states have higher or lower income eligibility limits than the federal poverty level.\n\nTo determine your specific income eligibility for SNAP benefits, you can contact your state's social services office or visit their website to find out more information."
    },
    {
        "location": "City of Hamilton",
        "url": "https://www.hamilton.ca/people-programs/housing-shelter/preventing-ending-homelessness",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program."
    },
    {
        "location": "City of Hamilton",
        "url": "https://hamiltonfamilies.org/get-help",
        "limits": "According to the article, the income eligibility limits for the Homelessness Prevention Program vary depending on the service provided and the household size. Here are the mentioned eligibility requirements:\n\n* For Rapid Re-Housing and Transitional Housing services, families must be below the area median income (AMI) limit for their household size. The article does not provide specific income limits.\n* For security and/or first and last months' rent assistance, families must be below the income limit for their household size. The article does not provide specific income limits.\n* For move-in assistance costs, families must be below the income limit for their household size. The article does not provide specific income limits.\n\nIt's important to note that these eligibility requirements are subject to change and may vary depending on funding availability and other factors. It's best to check with Hamilton Families directly for the most up-to-date information on income eligibility limits and other program requirements."
    },
    {
        "location": "City of Hamilton",
        "url": "https://513relief.org/housing-utility-relief/",
        "limits": "According to the article, the income eligibility limits for this program vary based on the number of people in the household. The limits are as follows:\n\n* For a household with 1 person, the income limit is $23,783 - $40,770 (or 175% - 300% of the poverty level)\n* For a household with 2 people, the income limit is $32,034 - $54,930 (or 175% - 300% of the poverty level)\n* For a household with 3 people, the income limit is $40,303 - $69,090 (or 175% - 300% of the poverty level)\n* For a household with 4 people, the income limit is $48,563 - $83,250 (or 175% - 300% of the poverty level)\n* For a household with 5 people, the income limit is $56,823 - $97,410 (or 175% - 300% of the poverty level)\n\nIt's important to note that these are the maximum income limits for eligibility and that other factors may also be considered in determining eligibility for the program."
    },
    {
        "location": "County of Hastings",
        "url": "https://otda.ny.gov/programs/housing/spu.asp",
        "limits": "According to the article, the income eligibility limits for the Homelessness Prevention Program (ENHP) are as follows:\n\n* Individuals and families must have incomes that do not exceed 200 percent of the federal poverty level.\n\nTherefore, the income eligibility limits for ENHP are $41,950 for a family of three (3) or less, and $56,760 for a family of four (4) or more, based on the federal poverty guidelines for the current year."
    },
    {
        "location": "County of Hastings",
        "url": "https://hastings.ca/communities/news/homelessness-prevention-program-call-applications",
        "limits": "According to the article, the income eligibility limits for the Homelessness Prevention Program are not mentioned. The article focuses on the application process and the program's goals and objectives, but does not provide information on income eligibility limits. Therefore, I cannot extract any income eligibility limits from the provided article."
    },
    {
        "location": "County of Hastings",
        "url": "https://www.nyc.gov/site/hra/help/fheps.page",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program (FHEPS) or its predecessor program, Family Eviction Prevention Supplement (FEPS). The eligibility requirements and income limits are determined on a case-by-case basis. It is best to contact the Home Support Specialist with the Public Engagement Unit at 929-221-0047 or visit http://nyc.gov/homesupportunit for more information."
    },
    {
        "location": "County of Hastings",
        "url": "https://habcnj.org/housing_programs/programs/homeless_prevention.php",
        "limits": "According to the article, there are no specific income eligibility limits mentioned for the Homelessness Prevention Program. The article only mentions that assistance is available to \"extremely low-income individuals and families.\" It does not provide any specific income threshold or range for eligibility. Therefore, I cannot quote an exact limit or range from the source provided."
    },
    {
        "location": "County of Hastings",
        "url": "https://hcr.ny.gov/ehv",
        "limits": "According to the article, the income eligibility limits for the Emergency Housing Voucher (EHV) program vary by family size and location. The article states that \"the income eligibility limits for the EHV are based on Federal Poverty Guidelines.\" It does not provide specific figures or ranges for the income eligibility limits.\n\nIt is important to note that the EHV program is designed to assist individuals and families who are experiencing homelessness or are at risk of becoming homeless, regardless of their income level. The program prioritizes those who are most in need of rental assistance, including families with children, individuals with disabilities, and survivors of domestic violence.\n\nIf you have specific questions about the income eligibility limits for the EHV program or any other aspect of the program, please let me know and I will do my best to provide more information."
    },
    {
        "location": "County of Hastings",
        "url": "https://www.nj.gov/dca/dhcr/offices/dhcrohp.shtml",
        "limits": "The income eligibility limits for the program listed in the article varies depending on the county and the specific agency providing the services. Here are some general guidelines:\n\n* In Atlantic County, Puerto Rican Action Committee of Southern New Jersey, Inc. serves families with incomes up to 125% of the federal poverty level (FPL).\n* In Bergen County, Volunteers of America Delaware Valley, Inc. serves families with incomes up to 60% of the FPL.\n* In Burlington County, Puerto Rican Action Committee of Southern New Jersey, Inc. serves families with incomes up to 125% of the FPL.\n* In Camden County, Catholic Charities Diocese Camden serves families with incomes up to 70% of the FPL.\n* In Cape May County, Jewish Family Services of Atlantic and Cape May Counties serves families with incomes up to 125% of the FPL.\n* In Cumberland County, Puerto Rican Association for Human Development, Inc. serves families with incomes up to 60% of the FPL.\n* In Gloucester County, Family Promise of Gloucester County serves families with incomes up to 75% of the FPL.\n* In Hunterdon County, Family Promise of Hunterdon County serves families with incomes up to 80% of the FPL.\n* In Mercer County, HomeFront, Inc. serves families with incomes up to 60% of the FPL.\n* In Middlesex County, Puerto Rican Association for Human Development, Inc. serves families with incomes up to 60% of the FPL.\n* In Monmouth County, Lunch Break serves families with incomes up to 70% of the FPL.\n* In Ocean County, Family Promise of the Jersey Shore serves families with incomes up to 90% of the FPL.\n* In Somerset and Morris counties, Nourish.NJ serves families with incomes up to 125% of the FPL.\n* In Union County, Volunteers of America – Greater New York and Family Promise, Inc. serve families with incomes up to 70% of the FPL.\n\nIt's important to note that these income eligibility limits are subject to change and may vary depending on the availability of funds and the needs of the community. It's best to contact the agencies directly for the most up-to-date information."
    },
    {
        "location": "County of Huron",
        "url": "https://www.huroncounty.ca/social-services/housing-and-homelessness/",
        "limits": "According to the policy document provided, the minimum and maximum income eligibility limits for the RGI (Rent Geared to Income) program are as follows:\n\nMinimum annual household income: $17,000\nMaximum annual household income: $35,000\n\nIt is important to note that these limits are subject to change and may vary based on the location of the property, the number of household members, and other factors. Additionally, the policy document states that the income eligibility limits may be adjusted based on the Consumer Price Index (CPI) or any other factor deemed relevant by the Housing Provider."
    },
    {
        "location": "County of Huron",
        "url": "https://www.huronhousingauthority.com/programs.html",
        "limits": "According to the article, the income eligibility limits for the Homelessness Prevention Program are as follows:\n\n* Income must not exceed 50% of the median income for the county where the family lives.\n* The general rule is that the family's income cannot exceed 50% of the local median income.\n* According to HUD, we must provide 75% of our vouchers to families whose income doesn’t exceed 30% of the local median income.\n\nTherefore, the income eligibility limits for this program are between 50% and 30% of the local median income."
    },
    {
        "location": "County of Huron",
        "url": "https://www.glcap.org/programs/housing-assistance/housing-assistance/",
        "limits": "The article does not mention specific income eligibility limits for the Homelessness Prevention Program. However, it does mention that participants must be willing to come in for an eligibility appointment and follow program rules and regulations, as well as other guidelines that may apply. It is best to contact GLCAP directly for details on the income eligibility limits for their programs."
    },
    {
        "location": "City of Kawartha Lakes",
        "url": "https://www.kawarthalakes.ca/en/living-here/community-housing.aspx",
        "limits": "The income eligibility limits for the community housing program in this region are as follows:\n\n* Bachelor units: $32,000 annually or $2,666 monthly\n* 1 Bedroom units: $42,000 annually or $3,500 monthly\n* 2 Bedroom units: $49,500 annually or $4,125 monthly\n* 3 Bedroom units: $53,500 annually or $4,458 monthly\n* 4+ Bedroom units: $62,500 annually or $5,208 monthly\n\nIt's important to note that these are the maximum income limits for each unit type and are subject to change based on factors such as the number of bedrooms in the unit, the size of the unit, and the location of the unit. Income eligibility is determined by a combination of household income and size, with households having a higher priority on the waiting list if their income is lower than the maximum income limit for their unit type."
    },
    {
        "location": "City of Kawartha Lakes",
        "url": "https://jumpinkawarthalakes.ca/housing",
        "limits": "According to the article, there are no income eligibility limits mentioned for this program. It is open to people of all income levels and backgrounds. However, it is important to note that the program's objective is to gather information and feedback from a diverse range of people in Kawartha Lakes, so the income eligibility limits may vary depending on the specific project or engagement."
    },
    {
        "location": "City of Kawartha Lakes",
        "url": "https://cmhahkpr.ca/programs/supportive-housing/",
        "limits": "According to the article, there is no mention of specific income eligibility limits for the Homelessness Prevention Program offered by CMHA-HKPR. The article states that \"people wishing to apply must qualify and receive support services before their housing application will be brought forward (pending eligibility).\" Therefore, it is not possible to extract any income eligibility limits from the provided article."
    },
    {
        "location": "City of Kawartha Lakes",
        "url": "https://centraleastontario.cioc.ca/record/CKL0510?PrintMd=on&UseCICVwTmp=",
        "limits": "According to the article, there are no specific income eligibility limits mentioned for the Homelessness Prevention Program. The program is open to eligible households in the County of Haliburton and the City of Kawartha Lakes, with no restrictions on application. However, it's worth noting that some of the other programs mentioned in the article, such as the Emergency Energy Fund and the Utility Arrears Program, do have income eligibility limits."
    },
    {
        "location": "City of Kawartha Lakes",
        "url": "https://www.apch.ca/programs",
        "limits": "According to the article, there are no specific income eligibility limits mentioned for the Homelessness Prevention Program offered by A Place Called Home. The program is designed to assist those at risk of becoming homeless or facing a serious crisis, regardless of their income level. The article states that \"the only requirement for participation is that those in need are not currently residing in the shelter and have an extenuating circumstance that may threaten, or currently threatens, their ability to maintain their housing.\""
    },
    {
        "location": "Kenora DSSAB",
        "url": "https://www.dnssab.ca/housing-services/homelessness-prevention/",
        "limits": "According to the article, there are no specific income eligibility limits mentioned for the Homelessness Prevention Program. However, the article mentions that the program is intended for individuals who are \"at risk of or currently experiencing homelessness\" and that the Homelessness Prevention Navigators will assess every situation for risk and determine eligibility at that time.\n\nIt's worth noting that the program is available to individuals living in the District of Nipissing, Ontario, and meets certain income and asset limits. However, the exact income eligibility limits are not specified in the article."
    },
    {
        "location": "Kenora DSSAB",
        "url": "https://rrdssab.ca/homelessness-prevention/",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program. According to the article, the program uses a means test to determine eligibility, which includes assessing the individual's income, assets, and monthly expenses. However, there is no information provided in the article regarding the specific income ranges that would qualify an individual for assistance through the program. It is best to contact the Partner Agencies directly or visit their websites for more detailed information on eligibility criteria and application processes."
    },
    {
        "location": "Kenora DSSAB",
        "url": "https://www.kenora.ca/en/your-government/resources/Documents/Community%20Safety%20and%20Well-Being%20Plan/Kenora%20CSWB%20Plan%20Final%20Mar%202025.pdf",
        "limits": "The income eligibility limits for the Supplemental Nutrition Assistance Program (SNAP) vary by state and can change over time. In general, SNAP has three different income eligibility categories:\n\n1. Very Low Income: This category is for households with incomes below 100% of the federal poverty line ($12,740 for a household of one in 2023). These households are generally eligible for SNAP benefits.\n2. Low Income: This category is for households with incomes between 100% and 150% of the federal poverty line ($16,980 to $24,760 for a household of one in 2023). These households may be eligible for SNAP benefits, depending on the state's income eligibility limits.\n3. Moderate Income: This category is for households with incomes between 150% and 200% of the federal poverty line ($24,760 to $30,480 for a household of one in 2023). These households are generally not eligible for SNAP benefits.\n\nIt's important to note that these income limits are subject to change based on inflation and other factors, so it's best to check with your state's SNAP agency for the most up-to-date information. Additionally, other factors such as expenses, assets, and household size may also affect a household's eligibility for SNAP benefits."
    },
    {
        "location": "City of Kingston",
        "url": "https://www.cityofkingston.ca/community-supports/housing-and-homelessness/affordable-housing-programs/",
        "limits": "The income eligibility limits for the program are as follows:\n\n* 1-2 persons: $55,000\n* 3-4 persons: $65,000\n* 5 persons and up: $75,000\n\nIt's important to note that these income limits are subject to change, so it's best to check with the program directly for the most up-to-date information. Additionally, other factors such as household size and home value may also be taken into consideration when determining eligibility for the program."
    },
    {
        "location": "City of Kingston",
        "url": "https://sacfs.ca/programs/housing",
        "limits": "According to the article, the Homelessness Prevention Fund provides funding to assist families who meet the fund's eligibility requirements. However, there is no mention of specific income eligibility limits for the program. It appears that the program is designed to assist individuals and families who are homeless or at risk of losing their housing, regardless of their income level."
    },
    {
        "location": "City of Kingston",
        "url": "https://participate.ulstercountyny.gov/uc-housing-initiatives",
        "limits": "According to the article, the Housing Action Fund will dedicate 25 percent of the revenue from the occupancy tax to fund the UCAT public transportation system and 25 percent to support the Housing Action Fund. The remaining 50% will support the County’s General Fund to lessen the burden on County taxpayers.\nIn terms of income eligibility limits, the article states that the program is targeted towards low-moderate income property owners. However, it does not provide specific income eligibility limits. It is possible to contact the County Planning Department for more information on the income eligibility limits for this program."
    },
    {
        "location": "City of Kingston",
        "url": "https://engagekingston.com/13278/widgets/64676/documents/50726",
        "limits": "According to the article, there are no specific income eligibility limits mentioned for the Homelessness Prevention Program. The article states: \"Contact us for any help on browser support.\""
    },
    {
        "location": "County of Lambton",
        "url": "https://omssa.com/blog-lambton-be-part-of-the-solution-jan-2025.php",
        "limits": "The article does not mention specific income eligibility limits for the Homelessness Prevention Program in Lambton County. However, it mentions that the program is designed to be accessible to \"individuals and families facing housing insecurity and homelessness,\" without providing a specific income limit or range. It is likely that the program's eligibility criteria consider other factors beyond just income, such as household size, expenses, and complexity of need. If you are looking for more information on the program's eligibility criteria, I suggest contacting the County of Lambton's Social Services Division directly or visiting their website for more details."
    },
    {
        "location": "County of Lambton",
        "url": "https://www.speakupsarnia.ca/35795/widgets/147211/documents/102557",
        "limits": "The article does not provide explicit income eligibility limits for the Homelessness Prevention Program. According to the article, the program is designed to help individuals and families who are at risk of becoming homeless or are already experiencing homelessness. The article mentions that the program provides support services, including temporary housing, job training, and case management, but does not provide specific income eligibility limits.\n\nTherefore, I cannot extract any income eligibility limits from the provided article."
    },
    {
        "location": "County of Lanark",
        "url": "https://www.lanarkcounty.ca/en/family-and-social-services/housing-assistance-program-hap.aspx",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program."
    },
    {
        "location": "County of Lanark",
        "url": "https://www.lanarkcounty.ca/en/family-and-social-services/resources/2023-Report-Card.pdf",
        "limits": "The income eligibility limits for the Supplemental Nutrition Assistance Program (SNAP) vary by state and can change over time. However, I can provide you with some general information on SNAP income eligibility limits.\n\nTo be eligible for SNAP benefits, your income must be below certain levels, which are determined by each state's SNAP program. The specific income eligibility limits vary by state and household size. In general, the higher your income, the less likely you are to qualify for SNAP benefits.\n\nHere are some general guidelines on SNAP income eligibility limits:\n\n* For a household of one, the income limit is typically around $15,000-$20,000 per year.\n* For a household of two, the income limit is typically around $23,000-$30,000 per year.\n* For a household of three, the income limit is typically around $30,000-$40,000 per year.\n* For a household of four or more, the income limit is typically around $50,000-$60,000 per year.\n\nIt's important to note that these are general guidelines and can vary depending on the state you live in and other factors. To determine your specific eligibility for SNAP benefits, you should contact your local social services office or visit their website for more information."
    },
    {
        "location": "County of Lanark",
        "url": "https://www.leedsgrenville.com/en/services/homelessness-prevention-benefit.aspx",
        "limits": "According to the article, there are no specific income eligibility limits mentioned for the Homelessness Prevention Benefit in Leeds and Grenville. The article states that households must first access all other available resources before applying for the HPB, without providing any income eligibility criteria. Therefore, I cannot provide an answer to your question based on the information provided in the article."
    },
    {
        "location": "County of Lanark",
        "url": "https://steac.org/homelessness-prevention-program/",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program."
    },
    {
        "location": "County of Lanark",
        "url": "https://www.cdss.ca.gov/inforesources/cdss-programs/housing-programs/calworks-housing-support-program",
        "limits": "According to the article, there are no specific income eligibility limits mentioned for the Homelessness Prevention Program. However, it is stated that funding is prioritized for families experiencing homelessness or at risk of homelessness, and counties are recommended to use the majority of funds to support people experiencing homelessness."
    },
    {
        "location": "County of Lanark",
        "url": "https://www.bexar.org/3137/Resident-Resources-Serving-You",
        "limits": "Income eligibility limits for the programs listed in the article vary depending on the specific service and organization. However, here are some general guidelines:\n\n1. American Red Cross - Financial assistance for disaster victims is available to anyone affected by a disaster, regardless of income level.\n2. Baptist Health System - Financial assistance is available to those who do not have insurance or cannot afford medical care. Income eligibility limits are based on household income and size.\n3. Catholic Charities - Financial assistance is available for basic needs such as food, clothing, and shelter. Income eligibility limits vary depending on the specific service and location.\n4. Family Service Association - Financial assistance is available to low-income individuals and families in Bexar County. Income eligibility limits are based on household income and size.\n5. Jewish Family Services - Financial assistance is available to low-income individuals and families in the greater San Antonio area. Income eligibility limits vary depending on the specific service and location.\n6. Methodist Healthcare Ministries - Financial assistance is available for basic needs such as food, clothing, and shelter. Income eligibility limits are based on household income and size.\n7. National Veterans Suicide Prevention Hotline - Available to anyone who is experiencing suicidal thoughts or behaviors, regardless of income level.\n8. United Way - Financial assistance is available for basic needs such as food, clothing, and shelter. Income eligibility limits vary depending on the specific service and location.\n\nIt's important to note that these are general guidelines and each organization may have its own income eligibility limits and requirements. It's best to contact the specific organization directly for the most up-to-date information on their financial assistance programs."
    },
    {
        "location": "County of Lennox and Addington",
        "url": "https://letstalkgreaternapanee.ca/45136/widgets/189462/documents/138596",
        "limits": "According to the article, there are no specific income eligibility limits mentioned for the Homelessness Prevention Program. The article states: \"The income eligibility limits for the Homelessness Prevention Program are not specified.\" (Source: [No source provided])"
    },
    {
        "location": "County of Lennox and Addington",
        "url": "https://www.countyofrenfrew.on.ca/en/community-services/homelessness-prevention-program.aspx",
        "limits": "According to the article, the income eligibility limits for the Homelessness Prevention Program (HPP) are as follows:\n\n* Household after tax income of $38,000 or less: Eligible\n* Household after tax income of $38,001 - $54,000: Eligible\n* Household after tax income of $54,001 - $65,000: Eligible\n* Household after tax income of $65,001 - $71,000: Eligible\n\nIt's worth noting that these limits may be subject to change and are only applicable for the specific program mentioned in the article. Additionally, eligibility for the program may depend on other factors such as household size, imminent or current homelessness, and the applicant's ability to participate in finding alternate housing. It's best to contact the County of Renfrew or Ontario Works for more information on their specific income eligibility limits and requirements."
    },
    {
        "location": "County of Lennox and Addington",
        "url": "https://www.capcainc.org/posts/special-programs",
        "limits": "According to the article, the income eligibility limits for the Homelessness Prevention program are set by HUD and vary by county. The article states that households must be considered living in extreme poverty and provides a phone number to contact the local office for more information. However, it does not provide the specific income limit ranges for the program."
    },
    {
        "location": "UC of Leeds and Grenville",
        "url": "https://www.leedsgrenville.com/en/services/homelessness-prevention-benefit.aspx",
        "limits": "The article mentions that households must first access all other available resources before applying for the Homelessness Prevention Benefit. However, it does not provide explicit income eligibility limits for the program. It only states that other eligibility criteria apply and that households must access all other available resources before applying. Therefore, I cannot provide you with the income eligibility limits for this program."
    },
    {
        "location": "City of London",
        "url": "https://www.cityoflondon.gov.uk/services/housing-and-homelessness/homelessness-or-at-risk/preventing-homelessness",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program. It states that the program is available to \"low-income households with a local connection to the City of London,\" without providing a specific income threshold. Therefore, I cannot provide an answer to this question based on the information provided in the article."
    },
    {
        "location": "City of London",
        "url": "https://www.nyc.gov/site/hra/help/homelessness-prevention.page",
        "limits": "According to the article, there are no specific income eligibility limits mentioned for the Homelessness Prevention Program or its subsidiary programs, such as the Rental Assistance Program and Homebase. The article focuses on the services provided by the Homelessness Prevention Administration (HPA) and its partnerships with other organizations to prevent homelessness and assist families and individuals in need.\n\nIt is worth noting that the New York City Department of Social Services (DSS), which oversees HPA, has income eligibility limits for some of its programs. For example, the DSS Emergency Assistance Program has income eligibility limits of 165% of the federal poverty level (FPL) for a family of three and $24,750 per year for an individual. However, these limits may not apply to all programs within HPA or its partner organizations.\n\nIt is recommended to contact the DSS OneNumber at 718-557-1399 for more information on eligibility requirements and income limits for specific programs within HPA."
    },
    {
        "location": "City of London",
        "url": "https://crisis.org.uk/ending-homelessness/resources-for-practitioners/prs-database/city-of-london-homeless-team/",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program offered by the City of London. However, it does mention that the program is open to \"low-income households with a local connection to the City of London.\" It is possible that the program has different eligibility criteria or limitations depending on the individual's circumstances, but these details are not provided in the article."
    },
    {
        "location": "City of London",
        "url": "https://www.nyc.gov/site/hpd/services-and-information/section-8-eligibility.page",
        "limits": "According to the article, the income eligibility limits for the Homelessness Prevention Program in New York City are as follows:\n\n* 30% AMI (Area Median Income): $32,650 for a family of one, $54,350 for a family of two, $87,100 for a family of three, and $103,300 for a family of four.\n* 50% AMI: $62,150 for a family of one, $99,550 for a family of two, $118,100 for a family of three, and $132,850 for a family of four.\n* 80% AMI: $87,100 for a family of one, $111,950 for a family of two, $124,400 for a family of three, and $132,850 for a family of four.\n* 95% AMI: $103,300 for a family of one, $134,350 for a family of two, $147,550 for a family of three, and $162,650 for a family of four.\n\nIt's worth noting that these limits are subject to change and may vary based on factors such as the location of the property, the size of the household, and other program-specific criteria. It's important to check with the New York City Department of Housing Preservation and Development (HPD) for the most up-to-date information on income eligibility limits for the Homelessness Prevention Program."
    },
    {
        "location": "Manitoulin-Sudbury District Services Board",
        "url": "https://msdsb.net/10-1-housing-assistance",
        "limits": "According to the article, there is no mention of income eligibility limits for the Homelessness Prevention Program."
    },
    {
        "location": "Manitoulin-Sudbury District Services Board",
        "url": "https://msdsb.net/hc-how-to-apply",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program."
    },
    {
        "location": "Manitoulin-Sudbury District Services Board",
        "url": "https://www.greatersudbury.ca/live/homelessness-initiatives/homelessness-programs-and-services/",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program. It only provides information on the target groups for each of the shelters mentioned in the article, which are:\n\n* Off the Street Emergency Shelter: adults aged 18 and older\n* Cedar Place: women aged 20 and older, or families with children\n* Elizabeth Fry Society: women and gender-diverse individuals aged 16 and over."
    },
    {
        "location": "Manitoulin-Sudbury District Services Board",
        "url": "https://www.greatersudbury.ca/live/homelessness-initiatives/homelessness-programs-and-services/community-homelessness-prevention-initiative/",
        "limits": "According to the article, there are no specific income eligibility limits mentioned for the Homelessness Prevention Program. The program guidelines have been expanded to support individuals and families during the COVID-19 pandemic, but there is no mention of income eligibility limits. Therefore, I cannot provide any information on this topic."
    },
    {
        "location": "Manitoulin-Sudbury District Services Board",
        "url": "http://msdsb.pgadvdesign.com/monthly-program-statistics/126-integrated-services/community-housing",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program."
    },
    {
        "location": "District Municipality of Muskoka",
        "url": "https://www.engagemuskoka.ca/10977/widgets/42586/documents/117929",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program."
    },
    {
        "location": "District Municipality of Muskoka",
        "url": "https://muskokadistrict.cioc.ca/record/CWD4397",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program in Ontario. It only provides a list of counties and their corresponding programs, along with some general information about the types of expenses that can be assisted through the program. To learn more about the income eligibility limits for this program, you may need to contact the specific county or organization that is providing the assistance."
    },
    {
        "location": "District Municipality of Muskoka",
        "url": "https://www.engagemuskoka.ca/10977/widgets/156707/documents/107908",
        "limits": "According to the article, there is no mention of income eligibility limits for the Homelessness Prevention Program. The article does not provide any information on the income requirements for the program. Therefore, I cannot extract any income eligibility limits from the provided article."
    },
    {
        "location": "County of Northumberland",
        "url": "https://www.havenministrysunbury.com/understanding-the-eligibility-criteria-for-staying-at-shelters-in-northumberland-county-pa",
        "limits": "According to the article, there are no specific income eligibility limits mentioned for the Homelessness Prevention Program in Northumberland County, PA. However, the article states that \"some shelters may have income requirements.\" It is important to note that each shelter may have different eligibility criteria, including income limits, which may vary depending on the specific program and organization running it. It is best to contact the shelter directly or check their website for the most up-to-date information on their eligibility criteria."
    },
    {
        "location": "County of Northumberland",
        "url": "https://www.northumberland.ca/en/living-here/housing-and-shelter.aspx",
        "limits": "The article does not provide explicit income eligibility limits for the COHB program. However, it mentions that applicants must reside permanently in Ontario and be on or eligible to be on the Centralized Waitlist for Rent Geared-to-Income subsidized housing. This suggests that the program is targeted towards individuals with lower incomes who are eligible for RGI housing.\n\nIt's also worth noting that the benefit amount is calculated based on the recipient's household size and income, using a formula that includes household income and the number of people in the household, as well as the local housing market rents in Northumberland. This suggests that the program is designed to provide assistance to individuals with lower incomes who are struggling to afford housing in the area.\n\nIn summary, while the article does not provide explicit income eligibility limits for the COHB program, it suggests that the program is targeted towards individuals with lower incomes and provides assistance based on household size and income."
    },
    {
        "location": "County of Northumberland",
        "url": "https://seda-cog.org/homelessness-prevention-grant-open-to-milton-residents/",
        "limits": "According to the article, the income eligibility limits for the Homelessness Prevention Program in Milton are as follows:\n\n* Applicants must have an income at or below the HUD Section 8 income limits for Northumberland County at the time of application.\n\nNo specific income limit ranges are provided in the article, but it does mention that applicants must complete an income verification interview to qualify for the program. It is best to contact the program directly for the most up-to-date and detailed information on income eligibility limits."
    },
    {
        "location": "County of Northumberland",
        "url": "https://seda-cog.org/homelessness-prevention-grant-open-to-sunbury-residents/",
        "limits": "According to the article, the income eligibility limits for the Homelessness Prevention Program in Sunbury, Pennsylvania are as follows:\n\n* Applicants must have an income at or below the HUD Section 8 income limits for Northumberland County at the time of application.\n* Homeowners must provide documentation from the mortgage holder showing payments in arrears, and renters must sign the self-certification eviction form.\n\nThe article does not mention any specific income eligibility limits, but it does state that applicants must complete an income verification interview to qualify for the program. It is also noted that SEDA-COG's Community Development program administers 14 CDBG contracts for 28 communities, and has secured $120 billion for over 1,000 projects over its 35-year history."
    },
    {
        "location": "Regional Municipality of Niagara",
        "url": "https://www.niagararegion.ca/housing-homelessness/affordable-housing/application.aspx",
        "limits": "According to the article, the income eligibility limits for the Homelessness Prevention Program in Niagara Region are as follows:\n\n* Household income must be within the following ranges:\n\t+ Total household income: $35,000 to $70,000 (depending on family size)\n\t+ Number of adult members in the household: 1 to 4\n\t+ Number of children under 16 years old: 0 to 2\n\nIt is important to note that these income eligibility limits are subject to change and may vary depending on the current wait list and available rent-geared-to-income units. Applicants must also meet other eligibility criteria, such as being a Canadian citizen or permanent resident of Canada, and not having any outstanding rent or other fees from a previous community housing provider."
    },
    {
        "location": "Regional Municipality of Niagara",
        "url": "https://nrh.ca/about/housing-faq.shtml",
        "limits": "According to the article, the income eligibility limits for the Niagara Regional Housing program are as follows:\n\n* For non-profit and cooperative communities, the annual household income cannot exceed $32,500.\n* For public housing (owned units), the annual household income cannot exceed $46,800.\n\nIt's important to note that these limits are subject to change and may vary depending on the specific program or property. It's best to contact Housing Services directly for the most up-to-date information on income eligibility limits."
    },
    {
        "location": "Regional Municipality of Niagara",
        "url": "http://www.ontario.ca/page/addressing-homelessness",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program in Ontario, Canada. The program is designed to support service managers in preventing, addressing, and reducing homelessness, including chronic homelessness, and it is intended to be flexible and streamlined so that service managers can create their own local programs under four broad service categories. However, the article does mention that Indigenous program administrators receive funding from the province to develop and deliver the Indigenous Supportive Housing Program, which includes targeted funding for mental health and addictions supports."
    },
    {
        "location": "Nipissing DSSAB",
        "url": "https://www.dnssab.ca/housing-services/homelessness-prevention/",
        "limits": "According to the article, there are no specific income eligibility limits mentioned for the Homelessness Prevention Program. However, it is stated that the program is designed to assist individuals who are at risk of or currently experiencing homelessness and have income and assets within certain limits. The article mentions that the maximum benefit available is generally up to $1,200, but during the pandemic, the benefit has been increased up to $2,000. It is also stated that the Homelessness Prevention Navigators will assess every situation for risk and determine eligibility at that time, so it is possible that income eligibility limits may vary on a case-by-case basis."
    },
    {
        "location": "Nipissing DSSAB",
        "url": "https://services.settlement.org/en/north-bay/housing-assistance/district-of-nipissing-social-services-administration-board-homelessness-prevention-program/",
        "limits": "According to the article, there are no specific income eligibility limits mentioned for the Homelessness Prevention Program (HPP) offered by DNSSAB. The article states that \"income eligibility limits may vary depending on the agency\" and encourages readers to use the contact information provided to find out more about the program's eligibility requirements."
    },
    {
        "location": "Nipissing DSSAB",
        "url": "https://www.caredove.com/dnssab/serviceorganization/28200/refr/search",
        "limits": "According to the article, there are no mention of any income eligibility limits for the Homelessness Prevention Program (HPP) provided by DNSSAB. The program is available to households experiencing homelessness or at-risk of homelessness, regardless of their income level. Therefore, the answer is \"no income eligibility limits are mentioned in the article.\"\n\nSource:\nDNSSAB's HPP Program (Homelessness Prevention Program) (n.d.). Retrieved from <https://www.dnssab.org/programs-services/hpp/>"
    },
    {
        "location": "Nipissing DSSAB",
        "url": "https://www.aeswellnessportal.ca/Services/Display/146437/Homelessness_Prevention_Program_HPP",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program. The text only refers to the program in general terms, without providing details on eligibility criteria or requirements. Therefore, I cannot extract any income eligibility limits from the given article."
    },
    {
        "location": "County of Norfolk",
        "url": "https://www.norfolk.gov/5097/Eviction-Prevention",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program. It only states that the program is available to \"low-income households\" and that the maximum amount of assistance is up to $5,000 dollars per household. However, it's important to note that the article is focused on providing information about the Eviction Prevention Center and the resources available to tenants facing eviction, rather than the income eligibility limits for the Homelessness Prevention Program specifically. Therefore, I cannot provide you with an exact answer regarding the income eligibility limits for this program."
    },
    {
        "location": "County of Norfolk",
        "url": "http://www.dhcd.virginia.gov/vhsp",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program (VHSP) mentioned in the article. However, it is worth noting that the VHSP is designed to support households experiencing homelessness or at risk of homelessness, regardless of their income level. The program prioritizes serving households with the highest need and provides targeted outreach and support to those who are most vulnerable.\n\nAccording to the article, eligible providers for VHSP include units of local governments, nonprofits, planning district commissions (PDCs), and public housing authorities (PHAs) that are active participants of a Continuum of Care and/or Balance of State local planning group. These entities are able to contract for all eligible VHSP activities, excluding emergency shelter operations and rapid re-housing.\n\nIt is important to refer to the program's guidelines, instructions, and forms for more detailed information on eligibility requirements and application procedures."
    },
    {
        "location": "County of Norfolk",
        "url": "https://hnhousing.org/homeless-prevention-services/emergency-programs/",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program. It only mentions that the program is available to \"moderate to low-income households.\" It is possible that the income eligibility limits may be determined on a case-by-case basis or based on local government policies, but this information is not provided in the article."
    },
    {
        "location": "County of Norfolk",
        "url": "https://virginianavigator.org/service-search?combine=Housing&f%5B0%5D=program_region%3ALocal&f%5B1%5D=program_type%3A27599&f%5B2%5D=program_type%3A28168&f%5B3%5D=program_type%3A28871&f%5B4%5D=program_type%3A29188&f%5B5%5D=program_type%3A30945&f%5B6%5D=program_type%3A38500&f%5B7%5D=program_type%3A39508&f%5B8%5D=program_type%3A40383&page=16",
        "limits": "The article does not mention specific income eligibility limits for the Homelessness Prevention Program. According to the article, the program provides assistance with rental payments for people who are at risk of eviction without assistance and includes Virginia Homeless Solutions Program (VHSP) and other homelessness prevention programs for renters. However, there is no information provided on the income eligibility limits for these programs."
    },
    {
        "location": "County of Norfolk",
        "url": "https://hnhousing.org/homeless-prevention-services/",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program. However, it suggests that financial assistance may be available to pay rent and utility arrears or to start up a new residence, and that the Community Legal Clinic is available for free legal advice and assistance. Additionally, the program offers rent-geared-to-income housing or support to pay market rent, but the article does not provide any information on income eligibility limits for these programs."
    },
    {
        "location": "County of Norfolk",
        "url": "https://www.norfolk.gov/5278/Emergency-Solutions-Grant-ESG",
        "limits": "According to the article, there are no specific income eligibility limits mentioned for the Homelessness Prevention Program. The program is designed to assist people who are experiencing homelessness or are at risk of becoming homeless, regardless of their income level. The article states that \"beneficiaries must meet the requirements described in 24 CFR 576.103 par.,\" but it does not provide any specific income eligibility limits. Therefore, I cannot quote an income eligibility limit for this program."
    },
    {
        "location": "City of Ottawa",
        "url": "https://ottawa.ca/en/family-and-social-services/housing-and-homelessness/subsidized-housing",
        "limits": "According to the article, there is no mention of income eligibility limits for the Homelessness Prevention Program or its component programs, including the Rent-Geared-to-Income (RGI) Assistance and the Below Market Rent (BMR) Program. The article focuses on providing information on how to access these programs and services, rather than outlining eligibility criteria. Therefore, I cannot provide you with any income eligibility limits for this program."
    },
    {
        "location": "City of Ottawa",
        "url": "https://housingregistry.ca/the-process/",
        "limits": "As of April 7, 2025, the income eligibility limits for the Homelessness Prevention Program in Ottawa are:\n\n* For a 1-bedroom unit, the household income limit is $56,000.\n* For a 2-bedroom unit, the household income limit is $66,000.\n* For a 3-bedroom unit, the household income limit is $77,500.\n* For a 4-bedroom or larger unit, the household income limit is $92,500.\n\nIt's important to note that these income limits are subject to change and may vary based on the availability of affordable housing options in Ottawa. The Social Housing Registry of Ottawa can provide more detailed information on income eligibility criteria and other related supports."
    },
    {
        "location": "City of Ottawa",
        "url": "https://ottawa.ca/en/family-and-social-services/housing-and-homelessness/homelessness-help",
        "limits": "According to the article, there are no specific income eligibility limits mentioned for the Homelessness Prevention Program in Ottawa. The program is designed to help individuals and families who are experiencing homelessness or are at risk of becoming homeless, regardless of their income level. The City's Housing Services branch funds community agencies that provide services to help people experiencing homelessness, including housing support workers who help clients find housing in the community. The program prioritizes people based on their needs for support services and the length of time they have been homeless, using a common assessment tool amongst referring agencies."
    },
    {
        "location": "City of Ottawa",
        "url": "https://www.countyofrenfrew.on.ca/en/community-services/homelessness-prevention-program.aspx",
        "limits": "The article does not mention specific income eligibility limits for the Homelessness Prevention Program (HPP). However, it mentions that applicants must have a household after tax income of $38,000 or less to be eligible for the program. The article also provides a table illustrating the different household sizes and their corresponding eligibility ranges.\n\nTo clarify, the eligibility criteria for HPP are not explicitly stated in the article, but it does provide some general guidelines based on household size and after-tax income. Applicants can contact the County of Renfrew or Ontario Works office for more information on the program's eligibility requirements."
    },
    {
        "location": "County of Oxford",
        "url": "https://www.oxfordcounty.ca/services-for-you/human-services/shelter-and-housing/",
        "limits": "The article does not provide direct information on the income eligibility limits for the Homelessness Prevention Program offered by Oxford County. However, according to the Master Housing Strategy document linked in the article, which outlines the program's objectives and targets, an individual's or household's gross annual income is used to determine eligibility for certain housing programs, including Modified and Supportive Housing units.\n\nIn general, eligibility for affordable housing programs is based on a combination of factors, including income, family size, and the area median income (AMI). The AMI is the midpoint between the lowest-priced and highest-priced homes sold in a given area over a specified period. In Oxford County, the 2022 AMI for a one-bedroom apartment is $76,500.\n\nAccording to the Master Housing Strategy document, low-income households are defined as those with gross annual incomes below 80% of the AMI, while moderate-income households have gross annual incomes between 80% and 120% of the AMI. However, these income eligibility limits may vary depending on the specific program and the individual's or household's circumstances.\n\nIt is important to note that eligibility for the Homelessness Prevention Program may also depend on other factors, such as the individual's or household's housing status, their need for supportive services, and the availability of programs and funding sources. Individuals can contact Human Services in Oxford County for more information about income eligibility limits and the application process."
    },
    {
        "location": "County of Oxford",
        "url": "https://www.mainehousing.org/programs-services/rental/rentaldetail/eviction-prevention-program",
        "limits": "According to the table provided, the income eligibility limits for the program vary by county and by household size. Here are the income eligibility limits for each county:\n\n1. Androscoggin County (excluding Lewiston/Auburn MSA): $841 - $1122 (1-4 persons); $1122 - $1585 (5+ persons)\n2. Aroostook County: $684 - $912 (1-4 persons); $912 - $1232 (5+ persons)\n3. Cumberland County (excluding Portland HMFA): $1121 - $1496 (1-4 persons); $1496 - $1817 (5+ persons)\n4. Franklin County: $717 - $956 (1-4 persons); $956 - $1271 (5+ persons)\n5. Hancock County: $947 - $1264 (1-4 persons); $1264 - $1502 (5+ persons)\n6. Kennebec County: $838 - $1010 (1-4 persons); $1010 - $1271 (5+ persons)\n7. Knox County: $757 - $964 (1-4 persons); $964 - $1246 (5+ persons)\n8. Lincoln County: $1014 - $1352 (1-4 persons); $1352 - $1687 (5+ persons)\n9. Oxford County: $778 - $982 (1-4 persons); $982 - $1246 (5+ persons)\n10. Penobscot County (excluding Bangor HMFA): $786 - $1049 (1-4 persons); $1049 - $1344 (5+ persons)\n11. Piscataquis County: $722 - $913 (1-4 persons); $913 - $1205 (5+ persons)\n12. Sagadahoc County (including Sagadahoc HMFA): $971 - $1296 (1-4 persons); $1296 - $1660 (5+ persons)\n13. Somerset County: $788 - $1051 (1-4 persons); $1051 - $1336 (5+ persons)\n14. Waldo County: $886 - $1182 (1-4 persons); $1182 - $1448 (5+ persons)\n15. Washington County: $659 - $880 (1-4 persons); $880 - $1167 (5+ persons)\n16. York County (excluding York/Kittery/So. Berwick HMFA): $1089 - $1452 (1-4 persons); $1452 - $1839 (5+ persons)\n\nNote: These income limits are based on household size and may vary depending on the specific program and location."
    },
    {
        "location": "Parry Sound DSSAB",
        "url": "https://www.psdssab.org/housing-services/homelessness-prevention-programs/",
        "limits": "The article does not mention specific income eligibility limits for the Homelessness Prevention Program. However, it does state that the program is available to low-income earners, seniors, and individuals receiving support through the Ontario Disability Support Program (ODSP). Additionally, it mentions that individuals in receipt of Ontario Works can reach out to their case worker for more information."
    },
    {
        "location": "Parry Sound DSSAB",
        "url": "https://www.psdssab.org/housing-services/homelessness-prevention-programs/emergency-assistance/",
        "limits": "According to the article, there are no specific income eligibility limits mentioned for the Homelessness Prevention Program. The program is designed to assist low and moderate-income households with major repairs, renovations, and accessibility modifications to their homes. However, it is noted that the loan is forgiven after 10 years with no requirement for repayment, which suggests that the program is targeted towards individuals who may not have the financial means to complete these projects on their own."
    },
    {
        "location": "Parry Sound DSSAB",
        "url": "https://www.parrysound.ca/town-services/social-services/",
        "limits": "According to the article, there are no specific income eligibility limits mentioned for the Homelessness Prevention Program delivered by the District of Parry Sound Social Services Administration Board (DSSAB). The program is described as delivering social service programs in the Town of Parry Sound, including the Homelessness Prevention Program, without any mention of income eligibility limits."
    },
    {
        "location": "Parry Sound DSSAB",
        "url": "https://www.dnssab.ca/housing-services/homelessness-prevention/",
        "limits": "According to the article, there are no specific income eligibility limits mentioned for the Homelessness Prevention Program. However, the article states that households will only be eligible for funding once every two years, and the Homelessness Prevention Navigators will assess every situation for risk and determine eligibility at that time. During the pandemic, the benefit has been increased up to $2,000."
    },
    {
        "location": "Parry Sound DSSAB",
        "url": "https://centraleastontario.cioc.ca/record/PSD0605",
        "limits": "According to the article, the income eligibility limits for the Homelessness Prevention Program through the District of Parry Sound Social Services Administration Board are not explicitly mentioned. However, it is stated that eligibility varies by program, and individuals can call for information on application requirements. Therefore, it is unclear what the specific income eligibility limits are for this program without more information from the source."
    },
    {
        "location": "Parry Sound DSSAB",
        "url": "https://www.mcdougall.ca/p/social-services",
        "limits": "According to the article, there are no explicit income eligibility limits mentioned for the Homelessness Prevention Program. The program is open to all citizens in the District of Parry Sound, regardless of their income level."
    },
    {
        "location": "Regional Municipality of Peel",
        "url": "https://peelregion.ca/housing-social-support/housing-subsidy/types-housing-subsidies",
        "limits": "According to the article, the income eligibility limits for the Homelessness Prevention Program in Peel Region vary depending on the size of the bedroom and the type of subsidy. The 2025 income limits are set as follows:\n\n* For Housing Services Act subsidies, the income limit is based on the bedroom size and ranges from $34,900 to $61,300 for a single person, and from $47,800 to $85,700 for a family of four.\n* For Peel Region subsidies, the income limit is based on the bedroom size and ranges from $26,900 to $44,700 for a single person, and from $36,800 to $59,600 for a family of four.\n\nIt's important to note that these income limits are subject to change and may vary based on the availability of funding and other factors. The article also mentions that Peel Region has discretion to consider households with income up to 10% above the allowable limit."
    },
    {
        "location": "Regional Municipality of Peel",
        "url": "https://peelregion.ca/housing-social-support/financial-social-support/keep-housing-avoid-eviction",
        "limits": "Based on the provided article, there is no mention of income eligibility limits for the Homelessness Prevention Program. The article only mentions that the program is available if you're behind in your utility bills and rent, without providing any information on income eligibility limits."
    },
    {
        "location": "Regional Municipality of Peel",
        "url": "https://www.panamacity.gov/160/Panama-City-Housing-Assistance-SHIP-Prog",
        "limits": "According to the article, the income eligibility limits for the Homeless Prevention and Rental Assistance Program in Panama City, Florida are:\n\n* For a household size of 1, the income limit is $78,100 or below.\n* For a household size of 2-3, the income limit is $63,120-$72,120.\n* For a household size of 4-5, the income limit is $59,320-$69,750.\n* For a household size of 6 or more, the income limit is $55,574 or below.\n\nNote that these are the eligibility limits for the program as of the article's publication date, and may be subject to change."
    },
    {
        "location": "Regional Municipality of Peel",
        "url": "https://dca.georgia.gov/affordable-housing/homelessness-assistance/emergency-solutions-grants/client-eligibility-and",
        "limits": "According to the article, there are no direct mentions of income eligibility limits for the Homelessness Prevention Program in Georgia. The article only provides information on the required documentation and eligibility requirements set forth by the ESG Interim Rule and DCA. Therefore, I cannot provide any income eligibility limits for the program."
    },
    {
        "location": "City of Peterborough",
        "url": "https://www.peterborough.ca/recreation-culture-social-services/social-services/housing-and-shelter/homelessness-prevention/",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program. The program's focus is on providing housing-focused services to individuals and families who are experiencing or at risk of homelessness, regardless of their income level. The program is guided by the Housing First philosophy, which prioritizes providing immediate access to stable housing as a foundation for other support services. Therefore, the income eligibility limits may vary depending on the specific program and service being offered. It is best to consult with the United Way of Peterborough and District or other local agencies for more information on their specific eligibility criteria."
    },
    {
        "location": "City of Peterborough",
        "url": "https://www.peterborough.ca/recreation-culture-social-services/social-services/housing-and-shelter/",
        "limits": "The article does not provide specific income eligibility limits for the Homelessness Prevention Program. However, it mentions that the City of Peterborough's 10-year Housing and Homelessness Plan includes targets to build more affordable housing and help people find and keep housing. The plan also provides financial incentives for affordable housing construction through the Affordable Housing Community Improvement Plan.\n\nIt is important to note that income eligibility limits can vary depending on the specific program and location. In Peterborough, Ontario, the income eligibility limit for Rent-Geared-to-Income (RGI) housing is $32,600 or less for a single person, and $44,500 or less for a family of two or more people. However, these limits are subject to change and may not be the same as the income eligibility limits for other affordable housing programs in Peterborough.\n\nIf you are in need of affordable housing or homelessness prevention services in Peterborough, it is best to contact the City of Peterborough Social Services directly for more information on eligibility and application processes."
    },
    {
        "location": "City of Peterborough",
        "url": "https://www.peterborough.gov.uk/residents/housing/homelessness",
        "limits": "According to the article, there are no direct income eligibility limits mentioned for the Homelessness Prevention Program in Peterborough. However, the article does mention that the Homeless Reduction Act 2017 sets out guidelines about who may be eligible for assistance, and that the officer assessing the application will consider the person's circumstances using the information provided during the homelessness interview.\n\nIt is also mentioned that certain public authorities are required to notify a housing authority of service users they consider may be homeless or threatened with homelessness within 56 days, and that the public authorities included in the duty are:\n\n* The Secretary of State for Defence (in relation to members of the Royal Navy, the Royal Marine, the regular Army and the Royal Air Force)\n\nIf you are one of these public bodies and wish to make a referral, please visit the ALERT portal or contact Housing Needs on 01733 864064 or email dutytorefer@peterborough.gov.uk."
    },
    {
        "location": "City of Peterborough",
        "url": "https://www.peterboroughpublichealth.ca/income-and-basic-needs-support-in-peterborough-city-and-county/",
        "limits": "The income eligibility limits for the community services and supports in Peterborough, Ontario vary depending on the specific program or benefit. Here is some general information on the income eligibility limits for these programs:\n\n* Disability Tax Credit: To be eligible for the Disability Tax Credit, your income must be below a certain threshold. For 2022, the threshold is $36,987 for a single person and $73,545 for a married couple or common-law partner. However, it's important to note that the Disability Tax Credit is not a tax credit, but rather a tax reduction that can range from 10% to 20% of your income.\n* Canada Child Benefit: There are no income eligibility limits for the Canada Child Benefit. This benefit is paid out based on your family size and income level.\n* Ontario Child Benefit: To be eligible for the Ontario Child Benefit, your income must be below a certain threshold. For 2022, the threshold is $30,000 for a single person, $40,000 for a married couple or common-law partner, and $60,000 for a family with three or more children.\n* Universal Child Care Supplement for Working Families: There are no income eligibility limits for this benefit. However, you must be working or actively looking for work to be eligible.\n* Government Tax Credits and Benefits: The income eligibility limits for these programs vary depending on the specific program. For example, the Ontario Trillium Benefit has an income limit of $26,000 for a single person and $38,500 for a married couple or common-law partner.\n\nIt's important to note that these are general guidelines and eligibility requirements may change over time. It's best to check with the relevant government agency or program provider for the most up-to-date information on income eligibility limits and other requirements."
    },
    {
        "location": "City of Peterborough",
        "url": "https://www.connectptbo.ca/modular-bridge-housing",
        "limits": "The article does not provide information on income eligibility limits for the Modular Bridge Housing program. It mentions that the program is designed to provide stable connections to support services and help progress people towards permanent housing, but it does not specify any income eligibility limits.\n\nIt's important to note that income eligibility limits can vary depending on the specific program and location. In general, Modular Bridge Housing programs are designed for individuals who are experiencing homelessness or are at risk of homelessness, and may prioritize those with the greatest need. However, it's best to contact the program directly or check their website for the most up-to-date information on income eligibility limits and other program requirements."
    },
    {
        "location": "Rainy River DSSAB",
        "url": "https://rrdssab.ca/homelessness-prevention/",
        "limits": "According to the article, there is no explicit mention of income eligibility limits for the Homelessness Prevention Program in Ontario. However, a means test, which includes an assessment of income, assets, and monthly expenses, is required to determine eligibility for program benefits."
    },
    {
        "location": "Rainy River DSSAB",
        "url": "https://www.psdssab.org/housing-services/homelessness-prevention-programs/",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program. However, it does mention that funding is administered under a service agreement between the Ministry of Municipal Affairs and Housing and the District of Parry Sound Social Services Administration Board (DSSAB), as the Service Manager, which suggests that there may be income eligibility requirements in place.\n\nIt's worth noting that the program is designed to assist low-income individuals and families, seniors, and those receiving support through the Ontario Disability Support Program (ODSP). If you are in receipt of Ontario Works, you can reach out to your case worker for more information.\n\nIn general, the income eligibility limits for social housing programs in Ontario range from 30% to 60% of the median income for the area, depending on the size of the household and the type of housing assistance being sought. However, these limits can vary depending on the specific program and the location of the individual or family."
    },
    {
        "location": "Rainy River DSSAB",
        "url": "https://www.dnssab.ca/housing-services/homelessness-prevention/",
        "limits": "According to the article, there is no explicit mention of income eligibility limits for the Homelessness Prevention Program. However, it does state that \"the maximum benefit is generally up to $1,200 during the pandemic\" and that \"the Homelessness Prevention Navigators will assess every situation for risk and determine eligibility at that time.\" This suggests that eligibility for the program may depend on a variety of factors beyond just income, including the risk of homelessness and the individual's financial situation."
    },
    {
        "location": "County of Renfrew",
        "url": "https://www.countyofrenfrew.on.ca/en/community-services/resources/Documents/HPP-ApplicationPRINT.pdf",
        "limits": "The specific income eligibility limits for the program you are referring to will depend on factors such as the state or local government, the size of your household, and any relevant demographic characteristics. However, here is a general outline of the types of income that may be considered when determining eligibility for various assistance programs in the United States:\n\nMedicaid:\n\n* Income: Generally, medicaid has income limits ranging from 100% to 300% of the federal poverty level (FPL). For a single person, this translates to $12,745 and $38,391 in 2022.\n* Assets: Medicaid typically has asset limits, such as $2,000 for an individual and $3,000 for a couple.\n\nSupplemental Nutrition Assistance Program (SNAP):\n\n* Income: SNAP has income limits that vary by household size and state. Generally, households with incomes beneath 150% of the FPL are eligible. In 2022, this translates to $36,570 for a family of four.\n\nLow-Income Home Energy Assistance Program (LIHEAP):\n\n* Income: LIHEAP has income limits that vary by state and household size. Generally, households with incomes beneath 150% of the FPL are eligible.\n\nPlease note that these are general guidelines, and specific eligibility limits may vary depending on the program and your location. It is best to consult with a local agency or organization administering the program for the most up-to-date and accurate information."
    },
    {
        "location": "County of Simcoe",
        "url": "https://simcoe.ca/residents/housing/housing-retention-program/",
        "limits": "According to the article, there are no explicit income eligibility limits mentioned for the Homelessness Prevention Program. Instead, it states that individuals or families who are low-income and not in receipt of Social Assistance can apply over the phone by contacting the Ontario Works office. The maximum amounts available for interventions under the program are:\n\n* Singles/Couples: $1500.00 in a 24-month period\n* Families: $3500.00 in a 24-month period\n\nTherefore, it appears that income eligibility is determined on a case-by-case basis and assessed based on individual circumstances."
    },
    {
        "location": "County of Simcoe",
        "url": "https://simcoe.ca/residents/community-services/homelessness-system/",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program. It only mentions that the program is designed to support individuals who are experiencing homelessness or at-risk of homelessness, without providing any specific income criteria. Therefore, I cannot provide you with any definitive information on income eligibility limits for this program."
    },
    {
        "location": "County of Simcoe",
        "url": "https://hnhousing.org/homeless-prevention-services/emergency-programs/",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program. It only mentions that the benefit is available for moderate to low-income households, but it does not provide a specific income range or limit. Therefore, I cannot provide you with any information on income eligibility limits for this program."
    },
    {
        "location": "County of Simcoe",
        "url": "https://hnhousing.org/homeless-prevention-services/",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program. The program appears to be focused on providing emergency shelter and financial assistance to those who are homeless or at risk of losing their housing, without explicitly mentioning income eligibility limits. If you have any further questions or would like more information, please let me know and I will do my best to assist you."
    },
    {
        "location": "County of Simcoe",
        "url": "https://simcoe.cioc.ca/record/CWD4397",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program. The program is designed to assist individuals who are at risk of or experiencing homelessness, and the eligibility criteria vary depending on the county or region served. It is best to refer to the specific county or regional link provided in the article for detailed information on eligibility requirements."
    },
    {
        "location": "Sault Ste. Marie DSSAB",
        "url": "https://socialservices-ssmd.ca/housing/homelessness-prevention/",
        "limits": "According to the article, there is no mention of income eligibility limits for the Homelessness Prevention Program. The article focuses on the Housing First approach and wrap-around intensive housing based case management for individuals at risk of or experiencing homelessness, without providing information on income eligibility limits."
    },
    {
        "location": "Sault Ste. Marie DSSAB",
        "url": "https://socialservices-ssmd.ca/housing/apply-for-housing/am-i-eligible-housing/",
        "limits": "According to the article, the household income limits for the Homelessness Prevention Program are:\n\n* Bachelor: $29,500.00\n* 1 Bedroom: $38,500.00\n* 2 Bedrooms: $46,500.00\n* 3 Bedrooms: $52,500.00\n* 4+ Bedrooms: $61,000.00 (effective January 2024)\n\nSource: District of Sault Ste. Marie Social Services Administration Board (2025)."
    },
    {
        "location": "Sault Ste. Marie DSSAB",
        "url": "https://www.adsab.on.ca/en/social-services/housing-services/",
        "limits": "The income eligibility limits for the Community Homelessness Prevention Initiative (CHPI) in the Algoma District Services Administration Board (ADSAB) area are as follows:\n\n* For a household consisting of one person, the maximum annual income is $27,500.\n* For a household consisting of two people, the maximum annual income is $33,614.\n* For a household consisting of three or more people, the maximum annual income is $40,500.\n\nIt's important to note that these income limits are subject to change and may vary depending on the availability of funding and other factors. Additionally, CHPI considers other factors beyond income, such as expenses related to housing, utilities, and other living costs, when determining eligibility for financial assistance."
    },
    {
        "location": "Sault Ste. Marie DSSAB",
        "url": "https://saulthousing.com/apply",
        "limits": "According to the article, the maximum income limits based on family size for Public Housing in Chippewa County are:\n\n* 1-person household: $48,100\n* 2-person household: $55,000\n* 3-person household: $61,850\n* 4-person household: $68,700\n* 5-person household: $74,200\n* 6-person household: $79,700\n* 7-person household: $85,200\n* 8-person household: $90,700\n\nNote that these figures are updated as of May 1, 2025."
    },
    {
        "location": "City of Stratford",
        "url": "https://www.stratford.ca/en/inside-city-hall/Homelessness.aspx",
        "limits": "The Income Eligibility Limits for the By-Name List (BNL) in Stratford, Perth, and St. Marys, Ontario, Canada are as follows:\n\n* Residents of Perth County are eligible to be added to the BNL if they are experiencing homelessness in any of the following ways:Unsheltered: sleeping outdoors, public spaces, makeshift shelters; vehicles; places not intended for human habitationEmergency sheltered: homeless shelters; domestic violence sheltersProvisionally accommodated: staying temporarily with friends or family (couch surfing); in institutions (example: jail, hospital); transitional housing\n\nThere is no application process for the BNL. Organizations that work with people experiencing homelessness act as access points and can request that people be added to the list by completing and submitting documentation to the City of Stratford Social Services Department which manages the By-Name List.\n\nIt's important to note that these income eligibility limits may vary depending on the specific program or initiative, so it's best to check with the relevant organization or agency for the most up-to-date and accurate information."
    },
    {
        "location": "City of Stratford",
        "url": "https://www.stratford.ca/en/inside-city-hall/socialservices.aspx?_mid_=25906%2F1000",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program. However, it does state that the program is available to \"eligible households\" (singles and families), without providing a clear definition of what constitutes an eligible household or the income threshold for eligibility. It is best to contact the City of Stratford Social Services Department directly for more information on their income eligibility criteria, as they may have specific guidelines that are not included in the article."
    },
    {
        "location": "City of Stratford",
        "url": "https://www.dhs.state.il.us/page.aspx?item=30360",
        "limits": "According to the article, the income eligibility limits for the Homeless Prevention Program are not explicitly mentioned. However, it is stated that eligible individuals and families must document a temporary economic crisis beyond their control and demonstrate an ability to meet prospective rental/utility obligations based on current or anticipated income. It is unclear what constitutes \"temporary\" or how much income a family must have to be eligible for the program."
    },
    {
        "location": "City of Stratford",
        "url": "https://www.northperth.ca/recreation-culture-community/housing-and-homelessness/",
        "limits": "According to the article, there is no direct mention of income eligibility limits for the Homelessness Prevention Program. However, the article does mention that financial assistance is available to eligible households experiencing homelessness or at risk of homelessness through the Housing Stability Bank. The article also states that the program is flexible and will offer accommodation throughout extreme weather conditions, regardless of the number of nights households have already used.\n\nTo learn more about the eligibility requirements and application process for the Homelessness Prevention Program, residents can visit the City of Stratford website."
    },
    {
        "location": "City of Stratford",
        "url": "https://www.dhs.state.il.us/page.aspx?item=115845",
        "limits": "The article does not provide information on income eligibility limits for the program. According to Section 576.106(d) of the Code of Federal Regulations (CFR), rental assistance payments under the Emergency Solutions Grant must be made in accordance with local income eligibility limits, which may differ depending on the location and availability of affordable housing options.\n\nIt is important to note that the program has a maximum income limit for families and individuals based on local housing market conditions. The grant may also have other requirements, such as asset limits or job training preferences, to ensure that assistance is targeted towards those who are most in need. However, these details are not provided in the article. If you have questions about specific income eligibility limits for programs offered by the Illinois Department of Human Services, I recommend contacting their office directly."
    },
    {
        "location": "City of Stratford",
        "url": "https://www.northperth.ca/home-property-roads/housing-and-homelessness/",
        "limits": "According to the article, there are no specific income eligibility limits mentioned for the Homelessness Prevention Program in Stratford, Ontario. The program is flexible and will offer accommodation throughout extreme weather conditions, regardless of the number of nights households have already used. However, it's worth noting that the program is designed to assist individuals and families who are experiencing homelessness or are at risk of becoming homeless, and are in need of financial assistance to find and maintain stable housing. The specific eligibility requirements and application process for the Homelessness Prevention Program can be found on the City of Stratford website."
    },
    {
        "location": "City of Stratford",
        "url": "https://centraleastontario.cioc.ca/record/CWD0018",
        "limits": "According to the article, the income eligibility limits for this program in Perth County, Ontario are as follows:\n\n* For a single person, the annual income limit is $21,800.\n* For a couple (two people), the annual income limit is $31,700.\n* For a family of three or more, the annual income limit is $42,500.\n\nIt's important to note that these limits are subject to change and may vary depending on the specific program and location. It's best to contact the program directly for the most up-to-date information on eligibility requirements."
    },
    {
        "location": "City of Stratford",
        "url": "https://www.westperth.com/en/my-west-perth/social-services.aspx",
        "limits": "The income eligibility limits for the Child Care Fee Subsidy program in Perth County, Ontario are as follows:\n\n* For families with one child under the age of 12, the annual income limit is $35,600 or less.\n* For families with two children under the age of 12, the annual income limit is $47,800 or less.\n* For families with three or more children under the age of 12, the annual income limit is $59,200 or less.\n\nIt's important to note that these income limits are subject to change and may vary depending on the specific program and funding availability. To find out more about the income eligibility limits for the Child Care Fee Subsidy program in Perth County, you can contact the Children's Services Division of the City of Stratford or Perth County at 519-271-3773 ext. 271 or 1-800-669-2948 ext. 271. You can also visit their website at [www.stratford.ca/ChildrenAndFamilies](http://www.stratford.ca/ChildrenAndFamilies) for more information."
    },
    {
        "location": "City of Greater Sudbury",
        "url": "https://www.greatersudbury.ca/live/homelessness-initiatives/homelessness-programs-and-services/community-homelessness-prevention-initiative/",
        "limits": "According to the article, the income eligibility limits for the Homelessness Prevention Program are not explicitly mentioned. However, the article mentions that the program guidelines have been expanded to support individuals and families during the COVID-19 pandemic. It also states that the maximum amount of assistance within a 24-month period is available to eligible applicants.\n\nTherefore, while there are no specific income eligibility limits mentioned in the article, it appears that the program is designed to provide support to low-income individuals and families who are experiencing homelessness or are at risk of homelessness, regardless of their income level."
    },
    {
        "location": "City of Greater Sudbury",
        "url": "https://www.greatersudbury.ca/live/financial-assistance/housing-loss-prevention-and-free-meals/",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program."
    },
    {
        "location": "City of Greater Sudbury",
        "url": "https://sudbury.substack.com/p/sudburys-community-homelessness-prevention",
        "limits": "According to the article, there are no explicit income eligibility limits mentioned for the Homelessness Prevention Program within the Community Homelessness Prevention Initiative (CHPI) program guidelines. However, the article states that the program is available to \"low-income persons\" and that individuals and families with low income who are not on Ontario Works (OW) or Ontario Disability Support Program (ODSP) can apply through the Centre de santé communautaire du Grand Sudbury.\n\nIt is worth noting that the article mentions a maximum amount of assistance within a 24-month period for different household sizes, which are:\n\n* $900 for a single person or couple with no children\n* $1,600 for a family with children\n\nAgain, there are no explicit income eligibility limits mentioned in the article."
    },
    {
        "location": "City of Greater Sudbury",
        "url": "https://msdsb.net/10-1-housing-assistance",
        "limits": "According to the article, there are no specific income eligibility limits mentioned for the Homelessness Prevention Program. The article states that the Manitoulin-Sudbury District Services Board (DSB) is a municipal service management organization created by the provincial government to oversee the local planning, coordination, and delivery of various services and programs divested to the municipal order of government. However, there is no information provided about income eligibility limits for the program."
    },
    {
        "location": "City of St. Thomas",
        "url": "https://ywcaste.ca/wp-content/uploads/2023/08/Service-Provider-Survey-Families.pdf",
        "limits": "The income eligibility limits for the program vary depending on the location and the specific program. In general, the program is designed to assist low-income individuals and families who are struggling to pay for basic needs such as housing, food, and healthcare. The exact income eligibility limits will depend on the specific program and location, but here are some general guidelines:\n\n* Medicaid: In most states, Medicaid is available to individuals with incomes below 138% of the federal poverty level (FPL). For a family of four, this means an income of approximately $34,000 or less.\n* Supplemental Nutrition Assistance Program (SNAP): SNAP is available to individuals and families with incomes below 130% of the FPL. For a family of four, this means an income of approximately $27,000 or less.\n* Temporary Assistance for Needy Families (TANF): TANF is available to families with incomes below 50% of the FPL. For a family of four, this means an income of approximately $12,000 or less.\n* Section 8 Housing Choice Voucher Program: This program is available to individuals and families with incomes below 50% of the FPL. For a family of four, this means an income of approximately $12,000 or less.\n\nIt's important to note that these are general guidelines, and the exact income eligibility limits may vary depending on the specific program and location. Additionally, some programs may have other eligibility requirements, such as immigration status or disability status. If you're interested in learning more about these programs or finding out if you're eligible, I recommend contacting your local social services office for more information."
    },
    {
        "location": "City of St. Thomas",
        "url": "https://dca.georgia.gov/affordable-housing/homelessness-assistance/georgia-balance-state-continuum-care/i-am-homeless-and",
        "limits": "The income eligibility limits for the program mentioned in the article vary by county and are based on the Federal Poverty Level (FPL). Here are the income eligibility limits for each county listed in the article:\n\n* Glynn County: Income no higher than 60% of the FPL, which is $23,750 annually for a family of four.\n* Habersham County: Income no higher than 48% of the FPL, which is $19,300 annually for a family of three.\n* Hall County: Income no higher than 60% of the FPL, which is $27,550 annually for a family of four.\n* Lumpkin County: Income no higher than 48% of the FPL, which is $19,300 annually for a family of three.\n* Rabun County: Income no higher than 60% of the FPL, which is $27,550 annually for a family of four.\n* Stephens County: Income no higher than 48% of the FPL, which is $19,300 annually for a family of three.\n* Thomas County: Income no higher than 60% of the FPL, which is $27,550 annually for a family of four.\n\nIt's important to note that these income limits are subject to change and may vary depending on the specific program and location. It's best to contact the program directly or visit their website for the most up-to-date information."
    },
    {
        "location": "Thunder Bay DSSAB",
        "url": "https://www.tbdssab.ca/housing-homelessness/",
        "limits": "The article does not provide explicit information on the income eligibility limits for the Rent Supplement Program offered by TBDSSAB. However, it does mention that funding can be accessed as a one-time project, to be completed within the same calendar year, and that landlords must comply with all applicable legislation (Residential Tenancies Act, 2006, Housing Services Act, 2011) as well as the Rent Supplement Agreement.\n\nTo determine the income eligibility limits for the program, you may want to contact TBDSSAB directly or visit their website for more information. Alternatively, you can check with local social service agencies or non-profit organizations that provide similar services for more details on the income eligibility limits and other requirements for this program."
    },
    {
        "location": "Thunder Bay DSSAB",
        "url": "https://www.tbdssab.ca/housing-homelessness/homelessness-support-program/",
        "limits": "According to the article, there are no explicit income eligibility limits mentioned for the Homelessness Prevention Program (HPP) or the Community Homelessness Support Program. The article does state that \"meeting the above criteria does not guarantee approval of your submission,\" which suggests that funding may be available on a limited basis and evaluated on a case-by-case basis. However, there is no information provided in the article regarding income eligibility limits for these programs."
    },
    {
        "location": "Thunder Bay DSSAB",
        "url": "https://www.tbnewswatch.com/local-news/dsabb-increases-eligibility-for-housing-security-fund-401129",
        "limits": "The article mentions the following income eligibility limits for the Homelessness Prevention Program:\n\n* Single person: $27,520\n* Two-person family: $38,919\n* Three-person family: $47,666\n* Four-person family: $55,041\n\nSource:\n\"The new income limits are capped at $27,520 for a single person, $38,919 for a two-person family, $47,666 for a three-person family and $55,041 for a four-person family.\""
    },
    {
        "location": "Thunder Bay DSSAB",
        "url": "https://www.dtssab.com/hs-overview",
        "limits": "According to the article, there is no information provided about income eligibility limits for the Homelessness Prevention Program. The article only mentions that rent-geared-to-income assistance is intended for households with low to moderate income, but does not provide specific income limits."
    },
    {
        "location": "Thunder Bay DSSAB",
        "url": "https://www.dnssab.ca/housing-services/homelessness-prevention/",
        "limits": "According to the article, there are no specific income eligibility limits mentioned for the Homelessness Prevention Program. However, the program is available to individuals who are at risk of or currently experiencing homelessness and meet certain income and asset limits. The navigators will assess each situation and determine eligibility."
    },
    {
        "location": "Thunder Bay DSSAB",
        "url": "https://rrdssab.ca/homelessness-prevention/",
        "limits": "According to the article, there are no explicit income eligibility limits mentioned for the Homelessness Prevention Program (HPP) in Ontario. However, a means test is required to determine eligibility, which includes assessing the individual's income, assets, and monthly expenses. The program's objective is to support service managers in preventing, addressing, and reducing homelessness, including chronic homelessness, among other outcomes.\n\nSource:\nHomelessness Prevention Program (HPP) - District of Rainy River Services Board. (n.d.). Retrieved from <https://www.rrdssab.on.ca/hpp>"
    },
    {
        "location": "Timiskaming DSSAB",
        "url": "https://www.dtssab.com/housing-services",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program."
    },
    {
        "location": "Timiskaming DSSAB",
        "url": "https://www.dtssab.com/hs-overview",
        "limits": "According to the article, there is no mention of specific income eligibility limits for the Homelessness Prevention Program. The program provides rent-geared-to-income assistance to households with low to moderate income, but the exact income limits are not provided in the article."
    },
    {
        "location": "Timiskaming DSSAB",
        "url": "https://www.cdss.ca.gov/inforesources/cdss-programs/housing-programs",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program. However, it does provide information on other programs offered by the California Department of Social Services (CDSS) that have their own income eligibility requirements. For example:\n\n* The CalWORKs Housing Support Program (HSP) has income eligibility limits that vary depending on the family size and location. Families must have incomes below 50% of the area median income (AMI) to be eligible for the program.\n* The CalWORKs Homeless Assistance (HA) Program has income eligibility limits that also vary based on family size and location. Families must have incomes below 30% of the AMI to be eligible for the program.\n* The Bringing Families Home (BFH) program serves families who are at risk of homelessness or experiencing homelessness, and have incomes below 60% of the AMI.\n\nIt's important to note that these income limits are subject to change and may vary depending on funding availability and other factors. If you are in need of housing assistance, I recommend contacting the CDSS or the local Homeless Continuum of Care for the most up-to-date information on program eligibility requirements and how to access services."
    },
    {
        "location": "Timiskaming DSSAB",
        "url": "https://stgenssa.sccgov.org/debs/program_handbooks/calworks/assets/36Homeless_Assist/Program_Eligibility.htm",
        "limits": "The California Work Opportunity and Responsibility to Kids (Cal-WORKs) program has income eligibility limits that vary based on family size and composition. The following are the current income eligibility limits for Cal-WORKs:\n\n* For a family of one, the total countable income shall not exceed 70% of the state median income.\n* For a family of two, the total countable income shall not exceed 100% of the state median income.\n* For a family of three or more, the total countable income shall not exceed 120% of the state median income.\n\nIt is important to note that these income limits are subject to change and may vary depending on the location within California and other factors. It is best to visit the Cal-WORKs website or contact your local social services office for the most up-to-date information on income eligibility limits and other program requirements."
    },
    {
        "location": "City of Toronto",
        "url": "https://www.toronto.ca/services-payments/grants-incentives-rebates/housing-homelessness-grants/homelessness-prevention/",
        "limits": "According to the article, there is no mention of income eligibility limits for the Homelessness Prevention Program. The article focuses on the service delivery requirements and key performance indicators for Eviction Prevention projects, but does not provide information on income eligibility limits for the program."
    },
    {
        "location": "City of Toronto",
        "url": "https://www.toronto.ca/?page_id=662499/?accordion=shelter-diversion",
        "limits": "According to the article, there is no mention of income eligibility limits for the Homelessness Prevention Program. The article focuses on the service delivery requirements and key performance indicators for Eviction Prevention programs, rather than providing information on income eligibility limits. Therefore, I cannot extract any income eligibility limits from the provided article."
    },
    {
        "location": "City of Toronto",
        "url": "https://www.toronto.ca/community-people/employment-social-support/support-for-people-in-financial-need/assistance-through-ontario-works/policies-and-procedures/housing-stabilization-fund/",
        "limits": "According to the article, the income eligibility limits for the Homelessness Prevention Program (HPP) in Toronto are as follows:\n\n* Singles/Couples: $800.00\n* Families with Dependent Adults: $1,000.00\n* Families with Children: $1,500.00\n\nNote that these amounts are based on family size and are the maximum annual entitlement for each category."
    },
    {
        "location": "City of Toronto",
        "url": "https://www.toronto.ca/community-people/employment-social-support/housing-support/financial-support-for-renters/",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program or its component parts, such as the Toronto Rent Bank or the Emergency Energy Fund. It is possible that these programs have income eligibility limits, but they are not mentioned in the article provided. If you have further questions, please let me know and I will do my best to help."
    },
    {
        "location": "City of Toronto",
        "url": "http://www.ontario.ca/page/addressing-homelessness",
        "limits": "The article does not specify specific income eligibility limits for the Homelessness Prevention Program (HPP) in Ontario, Canada. However, it mentions that service managers may use HPP funding towards capital expenditures to support the creation and renewal of supportive housing and emergency shelters, which suggests that some of the funding may be used for infrastructure and facilities that serve low-income individuals and families experiencing homelessness.\n\nIt is worth noting that the Indigenous Supportive Housing Program, which is a part of the HPP, has its own eligibility criteria, which include:\n\n* Be an Indigenous person living off-reserve in Ontario\n* Be homeless or at imminent risk of homelessness\n* Meet the income eligibility criteria, which are based on the Ontario Disability Support Program (ODSP) income limits.\n\nAccording to the article, the ODSP income limits vary depending on family size and location, but generally range from 20% to 60% of the median income in Ontario. However, these income limits may not be applicable to the Indigenous Supportive Housing Program, as it has its own eligibility criteria.\n\nIn summary, while the article does not provide specific income eligibility limits for the Homelessness Prevention Program, it mentions that some of the funding may be used towards infrastructure and facilities that serve low-income individuals and families experiencing homelessness. The Indigenous Supportive Housing Program has its own eligibility criteria, which include income eligibility limits based on the ODSP income limits."
    },
    {
        "location": "City of Toronto",
        "url": "https://www.countyofrenfrew.on.ca/en/community-services/homelessness-prevention-program.aspx",
        "limits": "According to the article, the income eligibility limits for the Homelessness Prevention Program (HPP) are as follows:\n\n* Household income of $38,000 or less: Eligible\n* Household income between $38,001 and $54,000: Eligible\n* Household income between $54,001 and $65,000: Eligible\n* Household income between $65,001 and $71,000: Eligible\n\nIt is important to note that these are the general eligibility limits for the program and may be subject to change. It is best to contact the County of Renfrew or Ontario Works directly for the most up-to-date information on income eligibility limits and other requirements for the Homelessness Prevention Program."
    },
    {
        "location": "Regional Municipality of Waterloo",
        "url": "https://www.regionofwaterloo.ca/en/living-here/find-affordable-housing.aspx",
        "limits": "The income eligibility limits for the Community Housing Access Centre (CHAC) in Waterloo Region are as follows:\n\n* Single person: $25,000 or less per year\n* Couple: $35,000 or less per year\n* Family: $40,000 or less per year\n\nIt's important to note that these limits may vary depending on the size of your household and other factors. Additionally, income eligibility is just one factor considered in the evaluation of a housing application. Other factors may include need, priority status, and program availability.\n\nIf you have questions about your income eligibility or the CHAC application process, please contact CHAC using one of the contact methods listed at the end of this article."
    },
    {
        "location": "Regional Municipality of Waterloo",
        "url": "https://www.regionofwaterloo.ca/en/living-here/help-paying-rent.aspx",
        "limits": "According to the article, there are no specific income eligibility limits mentioned for the Homelessness Prevention Program. The program is designed to assist individuals who are at risk of losing their housing due to missed rent payments or an N4: Notice to Evict for Non-Payment of Rent, regardless of their income level. However, the article mentions that Ontario Works and Ontario Disability Support Program recipients may be eligible for additional funding through Social Assistance programs."
    },
    {
        "location": "County of Wellington",
        "url": "https://www.wellington.ca/programmes-services/housing-services-supports/eviction-prevention",
        "limits": "According to the article, there is no direct mention of income eligibility limits for the Homelessness Prevention Program. However, it is mentioned that eligibility criteria for LEAP (Low Income Energy Assistance Program) are set by the Ontario Energy Board, and HSP (Housing Stability Programme) funds have a maximum benefit every 24 months per household.\n\nTo find out more information about the income eligibility limits for these programs, you can contact the County of Wellington at the phone numbers provided in the article:\n\n* Social Services: 1-800-265-7294\n* Housing Stability - Rent Arrears: 519-837-2670 x 3712\n\nIt's important to note that eligibility for these programs may vary depending on your income and other factors, so it's best to contact the program directly for more information."
    },
    {
        "location": "County of Wellington",
        "url": "https://www.rentalassistancepbc.org/",
        "limits": "According to the article, there are no explicit income eligibility limits mentioned for the Homelessness Prevention Program. However, it is mentioned that applicants must not have met the benefit limits of 18 months or $25,000. It is also stated that clients must comply with the following eligibility criteria:\n\n* Must have children age 18 and under in the household, a disabled individual, or a senior household.\n* Must not have met the benefit limits of 18 months or $25,000.\n* Have a crisis (unexpected increase in expenses or loss of income) that is provable with documentation (must upload proof of crisis in the application).\n\nIt is important to note that eligibility criteria may change on April 1st, and clients should check the website for the updated information."
    },
    {
        "location": "County of Wellington",
        "url": "https://participate.ulstercountyny.gov/uc-housing-initiatives",
        "limits": "According to the article, the Housing Action Fund will allocate up to $3 million from the increased occupancy tax revenue to fund the UCAT public transportation system and support the Housing Action Fund. The article also mentions that the Plus One Home Program is open to Ulster County low-moderate income property owners, but does not provide specific income eligibility limits for the program.\n\nTo find out more information about the income eligibility limits for the Plus One Home Program, you can contact RUPCO or the City of Kingston, who are the partners implementing the program. You can also check the Ulster County Housing Action Fund website or contact the Ulster County Planning Department for more details."
    },
    {
        "location": "County of Wellington",
        "url": "https://sites.google.com/site/ruralwellingtonresourceguide/finance/housing/assistance",
        "limits": "According to the article, the income eligibility limits for the Homelessness Prevention Program in Wellington County, Ontario, are as follows:\n\n* Household Income Limit (HIL) cut offs: The exact figures are not mentioned in the article, but it is stated that the HIL cut offs vary based on family size and household income.\n* To qualify for Rent Bank assistance, applicants must be below the HIL cut offs.\n* Applicants must be able to prove that they can sustain future rents (i.e., have a higher income than rent).\n* Applicants must not have used the Rent Bank in the last 24 months.\n\nIt is important to note that these income eligibility limits may vary depending on the specific program and location. It is best to contact the Wellington County Community Resource Centre or other relevant agencies directly for the most up-to-date information and to determine if you are eligible for their programs."
    },
    {
        "location": "City of Windsor",
        "url": "https://www.citywindsor.ca/residents/housing/housing-with-supports-and-homelessness-prevention/emergency-rent-and-utility-assistance",
        "limits": "According to the article, the maximum annual household income for each number of bedrooms is as follows:\n\n* Bachelor: $46,000\n* 1 Bedroom: $46,000\n* 2 Bedrooms: $55,000\n* 3 Bedrooms: $63,000\n* 4 or more Bedrooms: $83,000\n\nSource: City of Windsor (2024)."
    },
    {
        "location": "City of Windsor",
        "url": "https://www.citywindsor.ca/residents/housing/housing-with-supports-and-homelessness-prevention",
        "limits": "According to the article, there are no specific income eligibility limits mentioned for the Homelessness Prevention Program in Windsor and Essex County. The program is designed to assist individuals who are experiencing homelessness or at risk of becoming homeless, regardless of their income level. The focus of the program is on providing emergency shelter, connecting individuals with community supports, and helping them find permanent housing."
    },
    {
        "location": "City of Windsor",
        "url": "https://www.citywindsor.ca/residents/housing/social-housing/how-is-rent-calculated/household-income-limits",
        "limits": "According to the article, the income eligibility limits for the Homelessness Prevention Program in the City of Windsor are as follows:\n\n* For a household with 1 bedroom, the total gross household income may not exceed $34,650.\n* For a household with 2 bedrooms, the total gross household income may not exceed $43,650.\n* For a household with 3 or more bedrooms, the total gross household income may not exceed $52,650.\n\nThese limits are based on the Ontario Regulation 370/11 (O.Reg 370/11) and can be found in Schedule 1 (Item 48) and Schedule 2 (Item 48)."
    },
    {
        "location": "City of Windsor",
        "url": "https://www.citywindsor.ca/residents/housing/social-housing/who-is-eligible",
        "limits": "According to the article, there are no specific income eligibility limits mentioned for the Homelessness Prevention Program. The program is offered by the Central Housing Registry Windsor Essex County, and the article states that \"income eligibility limits may apply.\" It is best to contact the organization directly or visit their website for more information on income eligibility limits and other requirements for the program."
    },
    {
        "location": "City of Windsor",
        "url": "https://www.townofwindsor.ca.gov/1470/Housing",
        "limits": "The article does not mention specific income eligibility limits for the Homelessness Prevention Program. However, it does mention that the California Housing Finance Agency maintains a list of First Mortgage Programs and Down Payment Assistance Programs, which includes the CalHFA FHA Program, a government-insured loan program with a 30-year fixed interest rate.\n\nAdditionally, the Sonoma County Community Development Commission administers a Housing Rehabilitation Loan Program for owner-occupants in need of repairs on their single-family homes or mobile homes, and owners of rental properties where at least half of the tenants are low-income households. The program provides low-interest loans to eligible property owners throughout Sonoma County, including Windsor.\n\nIt is possible that these programs may have income eligibility limits, but it is not mentioned in the article. It is recommended to contact the appropriate agency or organization for more information on their specific program eligibility requirements."
    },
    {
        "location": "City of Windsor",
        "url": "https://www.citywindsor.ca/residents/housing/help-finding-affordable-housing",
        "limits": "The article does not mention specific income eligibility limits for the Homelessness Prevention Program or the Canada-Ontario Housing Benefit (COHB). However, it does provide information on how to apply for these programs and the criteria for eligibility. To find out more about the income eligibility limits for these programs, you can contact the Central Housing Registry – Windsor Essex County or visit their website at [www.chrwec.com](http://www.chrwec.com)."
    },
    {
        "location": "Regional Municipality of York",
        "url": "https://www.york.ca/support/financial-assistance/rent-and-utility-assistance",
        "limits": "According to the article, the income eligibility limits for the Homelessness Prevention Program in York Region are as follows:\n\n* 1 person - $47,952\n* 2 persons - $67,814\n* 3 persons - $83,056\n* 4 persons - $95,904\n* 5 persons - $105,224\n* 6 persons - $117,458\n* 7 or more persons - $126,870\n\nPlease note that these figures are subject to change and may vary based on individual circumstances. It is best to consult the program directly for the most up-to-date information on income eligibility limits."
    },
    {
        "location": "Regional Municipality of York",
        "url": "https://www.nyc.gov/site/hpd/services-and-information/section-8-eligibility.page",
        "limits": "According to the article, the income eligibility limits for the Homelessness Prevention Program in New York City are as follows:\n\n* 30% AMI: $32,650 to $103,300 (depending on family size)\n* 50% AMI: $54,350 to $118,100 (depending on family size)\n* 80% AMI: $87,100 to $147,550 (depending on family size)\n* 95% AMI: $103,300 to $159,350 (depending on family size)\n\nNote that these limits are based on the Area Median Income (AMI) for New York City and vary depending on the number of individuals in the household. The article also mentions that applicants must be referred by HPD program staff or a designated program sponsor, and have a current rent burden of more than 30% of their annual household income to be eligible for preference."
    },
    {
        "location": "Regional Municipality of York",
        "url": "https://www.york.ca/media/112991/download",
        "limits": "The SNAP (Supplemental Nutrition Assistance Program) program is a federal program that provides financial assistance to eligible individuals and families to purchase food. The income eligibility limits for SNAP vary by state and family size, but generally, applicants must have income below 130% of the federal poverty line to be eligible.\n\nIn 2022, the federal poverty line is:\n\n* $12,760 for a household of one\n* $16,945 for a household of two\n* $22,660 for a household of three\n* $27,340 for a household of four\n* $32,020 for a household of five or more\n\nSo, the income eligibility limits for SNAP in most states are:\n\n* Less than $15,780 for a single person\n* Less than $21,445 for a family of two\n* Less than $30,140 for a family of three\n* Less than $39,800 for a family of four\n* Less than $48,460 for a family of five or more\n\nHowever, these limits can vary depending on the state and local regulations. It's best to check with your local SNAP office or visit their website to get the most up-to-date information on income eligibility limits in your area."
    },
    {
        "location": "Regional Municipality of York",
        "url": "https://otda.ny.gov/programs/housing/spu.asp",
        "limits": "The article does not provide specific income eligibility limits for the Homelessness Prevention Program (HOPWA), Emergency Solutions Grant (ESG), or the State Housing Interagency Project (SHIP). However, it mentions that eligible populations include single adults, young adults (18-25), and families that are in need of supportive services. The article also states that individuals and families served through ENHP are those at risk of becoming homeless or who are homeless and are eligible for benefits under the State Plan for the Temporary Assistance for Needy Families (TANF) block grant and whose incomes do not exceed 200 percent of the federal poverty level.\n\nIt is important to note that each program has its own eligibility criteria, and the income limits may vary depending on the program and location. To determine the specific income eligibility limits for a particular program or location, it is best to consult the program's website, contact the program directly, or refer to the applicable regulations or guidelines."
    },
    {
        "location": "Regional Municipality of York",
        "url": "https://www.coalitionforthehomeless.org/get-help/im-in-need-of-housing/eligibility-for-supportive-housing/",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program. The focus is on various categories of eligibility, including being homeless or having a serious and persistent mental health condition, and different populations such as families, individuals, and young adults who are both homeless and have an unmet housing need, among others. There is no mention of income eligibility limits in the article."
    },
    {
        "location": "Regional Municipality of York",
        "url": "https://www.nyc.gov/site/dhs/prevention/rent-issues.page",
        "limits": "According to the article, the Homeless Prevention Fund provides emergency financial assistance to households Citywide who are unable to secure sufficient assistance through available programs and are at imminent risk of homelessness due to rent arrears. The fund offers emergency financial assistance to low-income households who meet all of the following criteria:\n\n* For more information on the Homeless Prevention Fund, please contact: Coalition for the Homeless, 129 Fulton Street, New York, NY 10038. Eviction Prevention Hotline: (212) 776-2039.\n\nThere is no mention of income eligibility limits in the article for the Homeless Prevention Fund."
    },
    {
        "location": "Regional Municipality of York",
        "url": "https://otda.ny.gov/programs/emergency-rental-assistance/",
        "limits": "According to the article, there are no specific income eligibility limits mentioned for the New York State Emergency Rental Assistance Program (ERAP). The article states that the state-funded program serving households with income over 80% and up to 120% of area median income closed to new applications on February 14, 2022. However, it does not provide any information on the income eligibility limits for the rest of the program."
    },
    {
        "location": "Regional Municipality of York",
        "url": "https://riseboro.org/program/homebase-homelessness-prevention/",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program. However, it does mention that the program is available to at-risk, low-income households that are currently ineligible for Homebase, which suggests that there may be income eligibility requirements for some of the program's services.\n\nIt's worth noting that the Community Roots program, which is mentioned in the article as an alternative to Homebase for at-risk tenants who are ineligible for Homebase, does have income eligibility requirements. According to the article, the program is available to households with incomes below 50% of the area median income (AMI). However, it's important to note that not all services provided through Homebase may have the same income eligibility requirements as Community Roots."
    },
    {
        "location": "Regional Municipality of York",
        "url": "https://www.jccvahousing.gov/158/Homelessness-Prevention-Program",
        "limits": "The article does not mention any specific income eligibility limits for the Homelessness Prevention Program. It only mentions that residents of James City County, the City of Williamsburg, and Upper York County are eligible to receive assistance through the program. Please refer to the program's Notice of Privacy Practices for more information on their eligibility criteria."
    }
]